{
  "document_info": {
    "title": "The 7th Sense: Character Database",
    "source_file": "ตัวละคร.pdf",
    "version": "1.0",
    "description": "ฐานข้อมูลตัวละครฉบับสมบูรณ์แบบไม่ตัดทอนรายละเอียด"
  },
  "characters": {
    "protagonists": {
      "male_lead": {
        "full_name": "เจ้าชาย เวเนเซีย โรมานอฟ เดอ น็อร์ธ นิธอเรีย (Prince Venezia Romanov de North Nithoria)",
        "nickname": "เนส (Nes)",
        "basic_info": {
          "gender": "ชาย",
          "age": 19,
          "ethnicity": "ลูกครึ่งไทย-นิธอเรีย",
          "height": "195 cm",
          "weight": "90 kg"
        },
        "personality": {
          "background": "เบื้องหลัง - ฉลาด ทันคน เจ้าเล่ห์ เจ้าแผนการ และชอบด้านเทคโนโลยี",
          "foreground": "เบื้องหน้า - เสเพล เจ้าชู้ ชอบเที่ยวและปาร์ตี้"
        },
        "appearance": {
          "physique": "เป็นรูปร่างแบบ Athletic Build หรือนักกีฬาที่ออกกำลังกายเป็นประจำ (Active Lifestyle) ไหล่กว้างผึ่งผาย แผ่นหลังหนา และมีกล้ามเนื้อที่คมชัดแต่ไม่เทอะทะ ลำตัวดูสมส่วนแข็งแรงแบบคนที่ผ่านการฝึกฝนร่างกายมาอย่างดีตั้งแต่เด็ก (สไตล์ราชวงศ์ยุโรป)",
          "movement": "แม้จะตัวใหญ่มาก แต่กลับเคลื่อนไหวได้คล่องแคล่วและเงียบเชียบ",
          "facial_structure": "สัดส่วนทองคำ (Golden Ratio) ทุกระเบียดนิ้ว ตั้งแต่ระยะห่างของดวงตา จนถึงแนวกรามที่คมกริบชัดเจน โครงหน้ามีความสมมาตรสูงมากจนดูเหมือนภาพกราฟิกที่เรนเดอร์มาอย่างเพอร์เฟกต์",
          "nose": "โด่งเป็นสันคมตรงตามสถาปัตยกรรมใบหน้าชาวยุโรป รับกับริมฝีปากหยักรูปกระจับที่มักจะประดับด้วยรอยยิ้มมุมปากขี้เล่น",
          "skin": "ขาวจัดโทนเย็น (Cool Undertone) ตามพันธุกรรมยุโรปแท้ ละเอียดเนียน",
          "hair": "สีดำสนิท (มองเผินๆ เหมือนคนไทย) แต่ถ้าต้องแสงแดดจะเห็นประกายน้ำตาลบรอนซ์เข้ม เส้นผมหยักศกนิดๆ มักจะปล่อยให้ยุ่งเหยิงตามสไตล์คนขี้เกียจจัดทรง",
          "eyes_true_color": "สีเทาควันบุหรี่ (Smoky Grey) ที่ดูเยือกเย็นและทรงอำนาจ",
          "genetic_trait": "วงแหวนสีทอง (Golden Halo) ที่ซ้อนอยู่รอบรูม่านตา สัญลักษณ์เฉพาะของผู้สืบทอดที่เหมาะสมที่สุดในรุ่นหลาน",
          "disguise": "ใส่คอนแทคเลนส์สีน้ำตาล เพื่อพรางตาให้ดูเหมือนหนุ่มลูกครึ่งทั่วไป แต่มักจะมีปัญหาเลนส์หลุดหรือเลื่อนบ่อยๆ เวลาเขาซุ่มซ่ามหรือทำตัวชิลเกินเหตุ",
          "fashion_style": "ชอบใส่เสื้อผ้า Oversize หรือเสื้อยืดธรรมดาๆ กับกางเกงที่ใส่สบายที่สุดเพื่อหนีภาพลักษณ์เจ้าชาย แต่ความสูงและออร่าสัดส่วนทองคำมักจะทะลุเสื้อผ้าธรรมดาออกมาเสมอ",
          "scent": "กลิ่นสะอาดๆ เหมือนป่าสนและไอเย็นของหิมะ (กลิ่นอายเฉพาะตัวของราชวงศ์นิธอเรีย)",
          "accessories": "มักจะใส่แว่นสายตาเลนส์ใส (แว่นหลอก) เพื่อช่วยพรางใบหน้าที่หล่อเกินไป แต่ไม่ค่อยได้ผลนักในสายตานิสา"
        },
        "status": {
          "nithoria": "โอรสองค์เล็กของเจ้าชายเวเนียส โรมานอฟ เดอ น็อร์ธ นิธอเรียกับพระชายาอัญญาวี โรมานอฟ เดอ น็อร์ธ นิธอเรีย จากพี่น้องทั้ง 4 คน",
          "thailand": "หลานชายคนเล็กของยายจันทร์และตาชาญ, น้องรหัสเจมส์"
        },
        "education": "คณะวิศวกรรมศาสตร์ สาขาวิชาวิศวกรรมอิเล็กทรอนิกส์ (Electronics & Machine Learning) ชั้นปีที่ 1"
      },
      "female_lead": {
        "full_name": "สุวรรณนิสา วิริยะวงศา (Suwannisa Wiriyawongsa)",
        "nickname": "นิสา (Nisa)",
        "basic_info": {
          "gender": "หญิง",
          "age": 18,
          "ethnicity": "ชาวไทยเชื้อสายอีสาน",
          "height": "175 cm",
          "weight": "70 kg"
        },
        "personality": {
          "background": "เบื้องหลัง - ฉลาด มีไหวพริบดีเลิศ นิ่งสงบและสุขุม มีความคล้ายผู้ชายเพราะสนิทกับพี่ชายมาก แต่ยังมีความเป็นกุลสตรี",
          "foreground": "เบื้องหน้า - ชอบทำตัวเหมือนสาวประเภทสอง เพราะสนิทกับแก๊งสาวสองในกลุ่มเพื่อนมาก จนคนอื่นเข้าใจผิดคิดว่าเป็นสาวสองจริงๆ"
        },
        "appearance": {
          "physique": "รูปร่างแบบคนที่ดูมีน้ำมีนวล สัดส่วนชัดเจนและสุขภาพดี และมีหน้าอกคัพ E",
          "skin": "ขาวแบบเอเชีย (Asian Fair Skin) เนียนละเอียดและเปล่งปลั่งสุขภาพดี ตัดกับสีเสื้อผ้าชัดเจน",
          "eyes_normal": "น้ำตาลเข้มค่อนอ่อน",
          "eyes_glint": "เมื่อต้องแสงแดดหรือแสงไฟสว่าง จะปรากฏประกายสีน้ำตาลอ่อนหรือสีอำพัน ที่ชัดเจนและดูใส",
          "eye_characteristics": "ตาคมโต มีชั้นตาชัดเจน แววตานิ่งสงบ มีตรรกะ และจดจ่อ (Focus) แบบผู้ใหญ่ในร่างเด็กสาว",
          "hair": "ผมหนามากและหยักศกเป็นลอนธรรมชาติ มีวอลลุ่มล้อมกรอบใบหน้า ช่วยให้ใบหน้าที่เป๊ะแบบตุ๊กตาดูซอฟต์ลงและมีความเป็นธรรมชาติ"
        },
        "status": "ลูกสาวคนเล็กของกำนันในหมู่บ้านที่มีสัมผัสที่ 7 เหมือนแม่ โดยสืบทอดทางสายเลือดจากแม่, สมาชิกกลุ่ม Devils, และว่าที่เฮดว้ากหญิงคนแรกในรุ่นถัดจากรุ่นของดิม, พี่เทคของนิสา (Note: ต้นฉบับพิมพ์ผิด น่าจะเป็น พี่เทคของรุ่นน้องปีหน้า หรือ น้องเทคของดิม), หลานเทคของเทียน และหลานเทคของเจมส์",
        "education": "คณะวิศวกรรมศาสตร์ สาขาวิชาวิศวกรรมอิเล็กทรอนิกส์ (Electronics & Machine Learning) ชั้นปีที่ 1"
      }
    },
    "male_lead_family": {
      "grandfather": {
        "name": "นายชาญ (Chan)",
        "nickname": "ตาชาญ (Grandpa Chan)",
        "age": 75,
        "description": "ชายชราเชื้อสายไทยแท้ รูปร่างผอมเกร็งแต่แข็งแรงแบบคนทำงานหนักมาทั้งชีวิต ผิวคล้ำแดด มีรอยเหี่ยวย่นที่บ่งบอกถึงประสบการณ์และความใจดี ผมสีดอกเลาตัดสั้นเกรียน",
        "personality": "ใจดี อบอุ่น รักหลานมาก ชอบเล่าเรื่องเก่าๆ ให้ฟัง เป็นคนสมถะและยึดมั่นในความถูกต้อง (เป็นเสาหลักทางจิตใจให้พระเอกในวัยเด็ก)",
        "status": "ญาติฝั่งแม่ (Maternal Grandfather) และเกษตรกรในพื้นที่ และคนในหมู่บ้านเดียวกันกับกำนันศักดิ์"
      },
      "grandmother": {
        "name": "นางจันทร์ (Jan)",
        "nickname": "ยายจันทร์ (Grandma Jan)",
        "age": 74,
        "description": "หญิงชราเชื้อสายไทย รูปร่างท้วมเล็กน้อยดูอบอุ่น ใบหน้ายิ้มแย้มแจ่มใสเสมอ มักใส่ชุดผ้าลูกไม้หรือผ้าถุงไหมไทย",
        "personality": "ใจกว้าง ทำอาหารอร่อย (โดยเฉพาะขนมไทย) ขี้เกรงใจแต่ก็ช่างเจรจา เป็นที่รักของคนในชุมชน",
        "status": "ญาติฝั่งแม่ (Maternal Grandmother) และคนในหมู่บ้านเดียวกันกับกำนันศักดิ์"
      },
      "father": {
        "name": "เจ้าชายเวเนียส โรมานอฟ เดอ น็อร์ธ นิธอเรีย (Prince Venias Romanov de North Nithoria)",
        "nickname": "เวเนียส (Venias) / ท่านพ่อ (Father)",
        "age": "50-55",
        "description": "เชื้อสายตะวันตก (North Nithorian) สูงสง่ากว่า 190 ซม. ตาสีฟ้าครามดุจน้ำแข็ง ผมสีทองคำขาวหรือสีเงินยวง บุคลิกทรงอำนาจและน่าเกรงขามสมฐานะราชนิกุลชั้นสูง",
        "personality": "สุขุม นิ่งลึก เด็ดขาดในการปกครอง แต่รักครอบครัวมาก (โดยเฉพาะภรรยาและลูกชายคนเล็ก) ยอมทิ้งวิถีชีวิตหรูหราบางส่วนเพื่อมาใช้ชีวิตเรียบง่ายกับภรรยาชาวไทยในบางครั้ง",
        "status": "พ่อของพระเอก และเชื้อพระวงศ์ชั้นสูงแห่งน็อร์ธ นิธอเรีย"
      },
      "mother": {
        "name": "พระชายาอัญญาวี โรมานอฟ เดอ น็อร์ธ นิธอเรีย (Princess Consort Anyawee Romanov de North Nithoria)",
        "maiden_name": "เจริญสุข",
        "nickname": "อัญ (Anya)",
        "age": "48-50",
        "description": "สาวไทยใบหน้าสวยหวานหยดย้อย กิริยามารยาทเรียบร้อยดั่งผ้าพับไว้ ผิวพรรณผ่องใส รูปร่างสมส่วนและยังดูอ่อนกว่าวัย",
        "personality": "อ่อนโยน เมตตา เฉลียวฉลาด และมีความอดทนสูง เป็นคนเดียวที่สามารถทำให้เจ้าชายเวเนียสใจเย็นลงได้",
        "status": "แม่ของพระเอก และพระชายาในเจ้าชายเวเนียส"
      },
      "brother_1": {
        "name": "เจ้าชายวาเลเรียส โรมานอฟ เดอ น็อร์ธ นิธอเรีย (Prince Valerius Romanov de North Nithoria)",
        "nickname": "วาล (Val)",
        "age": 28,
        "description": "ลูกครึ่งไทย-น็อร์ธ นิธอเรีย สูง 192 ซม. ผมสีทองเข้ม ตาสีฟ้าคมกริบ บุคลิกผู้นำเต็มเปี่ยม ใส่สูทหรือเครื่องแบบตลอดเวลา",
        "personality": "เคร่งขรึม เจ้าระเบียบ รับผิดชอบสูง (Heir vibe) หวงน้องชายคนเล็กมากแบบเงียบๆ",
        "status": "พี่ชายคนโต และว่าที่ผู้สืบทอดฐานันดรศักดิ์ลำดับถัดไป"
      },
      "brother_2": {
        "name": "เจ้าชายวิกเตอร์ โรมานอฟ เดอ น็อร์ธ นิธอเรีย (Prince Victor Romanov de North Nithoria)",
        "nickname": "วิค (Vic)",
        "age": 26,
        "description": "ลูกครึ่งไทย-น็อร์ธ นิธอเรีย สูง 190 ซม. รูปร่างกำยำแบบทหารหรือนักรบ มีแผลเป็นเล็กน้อยที่ดูเท่",
        "personality": "เลือดร้อน ใจนักเลง ตรงไปตรงมา ชอบการต่อสู้และการแข่งขัน (Protector vibe) ใครแตะต้องน้องชายต้องข้ามศพเขาไปก่อน",
        "status": "พี่ชายคนรอง และผู้บัญชาการหน่วยองครักษ์"
      },
      "brother_3": {
        "name": "เจ้าชายวินเซนต์ โรมานอฟ เดอ น็อร์ธ นิธอเรีย (Prince Vincent Romanov de North Nithoria)",
        "nickname": "วิน (Vin)",
        "age": 24,
        "description": "ลูกครึ่งไทย-น็อร์ธ นิธอเรีย สูง 188 ซม. หน้าตาหล่อเหลาเจ้าสำอางที่สุดในบรรดาพี่น้อง มีรอยยิ้มพราวเสน่ห์",
        "personality": "เจ้าเล่ห์ ฉลาดแกมโกง (ในทางธุรกิจ) ปากหวาน เข้าสังคมเก่ง (Diplomat vibe) เป็นคนคอยจัดการปัญหาหลังบ้านให้น้องชาย",
        "status": "พี่ชายคนที่สาม และนักธุรกิจ/นักการทูตของตระกูล"
      }
    },
    "female_lead_family": {
      "father": {
        "name": "ศักดิ์สิทธิ์ วิริยะวงศา (Saksit Wiriyawongsa)",
        "nickname": "ศักดิ์ (Sak)",
        "age": 51,
        "description": "ชาวไทยเชื้อสายอีสาน ส่วนสูง 190 เซนติเมตร รูปร่างแบบคนที่ทำงานหนักมาตลอด ร่างกายจึงหนาและกำยำแบบคนตรากตรำงานในไร่นา ไม่ใช่กล้ามเนื้อแบบคนเล่นฟิตเนส แต่เป็นความแข็งแรงที่ใช้งานได้จริง ซึ่งสะท้อนผ่านสายเลือดมายังนิสาให้มีหุ่นนักกีฬาที่สมส่วน, ผิวพรรณอาจกร้านแดดตามสไตล์ชาวไร่ชาวนาอีสาน แต่แฝงไปด้วยความภูมิฐาน",
        "personality": "ใจดี เด็ดขาด และเป็นกันเอง แต่หวงลูกมาก",
        "status": "กำนันในหมู่บ้าน"
      },
      "mother": {
        "name": "สุวรรณา วิริยะวงศา (Suwanna Wiriyawongsa)",
        "nickname": "ณา (Na)",
        "age": 49,
        "description": "ชาวไทยเชื้อสายอีสาน ส่วนสูง 170 เซนติเมตร รูปร่างแบบคนที่ทำงานหนักมาตลอด สะท้อนถึงความทะมัดทะแมง แข็งแรง ไม่ได้บอบบางจนทำอะไรไม่เป็น ซึ่งส่งผลต่อบุคลิกความแกร่งและความนิ่งขรึมของลูกสาวด้วย, สวยมากตามแบบฉบับคนอีสานที่มีเชื้อสายลาว ซึ่งมักจะมีเครื่องหน้าที่เป๊ะและละมุน",
        "personality": "ใจดี เป็นแม่ศรีเรือน",
        "status": "ภรรยากำนันในหมู่บ้าน"
      },
      "brother": {
        "name": "เนตรสิตางค์ วิริยะวงศา (Netsitang Wiriyawongsa)",
        "nickname": "เนตร (Net)",
        "age": 24,
        "description": "ชาวไทยเชื้อสายอีสาน ส่วนสูง 188 เซนติเมตร น้ำหนัก 88 กิโลกรัม รูปร่างที่สมบูรณ์แบบมากสำหรับผู้ชาย น้ำหนักที่สัมพันธ์กับส่วนสูงนี้บ่งบอกถึงรูปร่างที่ดู 'แน่นและสมส่วน' มีมวลกล้ามเนื้อจากการออกกำลังกายสม่ำเสมอตามสไตล์นักศึกษาแพทย์, เขาได้รับช่วงไหล่ที่ตั้งตรงและโครงสร้างร่างกายที่แข็งแรงมาจากกำนันศักดิ์ (พ่อ) แต่มีความละเอียดลออของใบหน้าที่ได้มาจากเจ๊ณา (แม่) ทำให้เขาเป็นคนที่มีบุคลิกสง่าผ่าเผยและดูดีในทุกชุดที่สวมใส่, พี่เนตรน่าจะมีดวงตาที่คมโตและมีเสน่ห์คล้ายกับ นิสา (น้องสาว) แต่แฝงไปด้วยความอบอุ่นมากกว่าความนิ่งขรึม",
        "personality": "ใจดี แต่ก็มีความเด็ดขาด หวงน้องสาวมาก",
        "education": "คณะแพทยศาสตร์ สาขาวิชาแพทยศาสตร์ (Medicine) ชั้นปีที่ 6",
        "status": "ลูกชายคนโตของกำนันศักดิ์และเจ๊ณา และเป็นพี่ชายของนิสา"
      },
      "brothers_boyfriend": {
        "name": "อัครเดช เตชะเสนา (Akkaradech Techasena)",
        "nickname": "เจมส์ (James)",
        "age": 22,
        "description": "ชาวไทยเชื้อสายเหนือและเป็นลูกเศรษฐี ส่วนสูง 190 เซนติเมตร น้ำหนัก 95 กิโลกรัม รูปร่างหนาและแข็งแกร่งแบบคนเล่นกีฬา (Rugby หรือ Basketball) ไหล่กว้างมากตามสไตล์ 'ช็อปวิศวะ' บุคลิกภาพดูน่าเกรงขามเพียงแค่ยืนนิ่งๆ, คมเข้ม คิ้วดกดำ แววตาดุดันและเฉียบขาดเมื่ออยู่ในหน้าที่เฮดว้าก แต่จะอ่อนโยนลงทันทีเมื่ออยู่ต่อหน้าเนตร, มักอยู่ในชุดนักศึกษาที่ถูกระเบียบเป๊ะ (เพื่อเป็นแบบอย่าง) หรือเสื้อช็อปภาคไฟฟ้าที่มีรอยเปื้อนเล็กน้อยจากการลงชอป",
        "personality": "ความเป็นผู้นำ (Leadership): มีอำนาจสั่งการสูง เด็ดขาด พูดคำไหนคำนั้น รักพวกพ้องและรุ่นน้องมาก (แม้จะแสดงออกด้วยการดุก็ตาม), ความรับผิดชอบ: ในฐานะเฮดว้าก เขาต้องแบกรับความกดดันจากทั้งอาจารย์และรุ่นพี่ เป็นคนที่มีความอดทนสูงมาก, โหมดคนคลั่งรัก: เมื่ออยู่กับ เนตร (แฟน) เจมส์จะกลายเป็นคนละคน จากเสือที่ว้ากรุ่นน้อง จะกลายเป็น 'ลูกแมว' ที่ยอมฟังคำสั่งหมอเนตรทุกอย่าง, การวางตัวกับครอบครัววิริยะวงศา: ให้ความเคารพกำนันสูงสุด และวางตัวเป็นพี่ชายที่หวังดีต่อนิสา",
        "education": "คณะวิศวกรรมศาสตร์ สาขาวิชาวิศวกรรมไฟฟ้า (Electrical Engineering) ชั้นปีที่ 4",
        "position": "อดีตเฮดว้าก (Head Hazer)",
        "status": "แฟนของเนตรและเป็นว่าที่ลูกเขยของครอบครัววิริยะวงศา พี่เทคของเทียน ลุงเทคของดิม และปู่เทคของนิสา, พี่รหัสเนส"
      },
      "relatives": [
        {
          "name": "นิโคลัส วิริยะวงศา (Nicholas Wiriyawongsa)",
          "nickname": "นิค (Nick)",
          "age": 19,
          "description": "ลูกครึ่งไทย-อังกฤษ สูง 185 เซนติเมตร น้ำหนัก 80 กิโลกรัม, หุ่นแบบนายแบบ (Slim Fit) ดูดีในชุดแบรนด์เนมและชุดกาวน์ ไม่ได้ดูบึกบึนแบบเจมส์ แต่ดูแพงและสะอาดสะอ้าน",
          "personality": "ความมั่นใจแบบคนเมือง, จิตใจดีแต่ติดหรู, ฉลาด (Genius), เป็นคนที่นิสาไว้วางใจที่สุด",
          "education": "คณะแพทยศาสตร์ สาขาวิชาแพทยศาสตร์ (Medicine) ชั้นปีที่ 1",
          "status": "ลูกชายเศรษฐีจากกรุงเทพฯ ครอบครัวทำธุรกิจระดับไฮเอนด์, แฟนของ แมท"
        },
        {
          "name": "นิศรุต วิริยะวงศา (Nitsarut Wiriyawongsa)",
          "nickname": "น็อร์ธ (North)",
          "age": 21,
          "description": "แฝดพี่ของนัท ชาวไทย สูง 188 เซนติเมตร น้ำหนัก 82 กิโลกรัม, แววตาอบอุ่น นิ่ง ลุ่มลึก มักสวมแว่นสายตาทรงเหลี่ยมมน",
          "personality": "นิ่งสงบและมีตรรกะ, ช่างสังเกต, เป็นผู้ใหญ่สูง",
          "education": "คณะแพทยศาสตร์ สาขาวิชาเวชศาสตร์ชันสูตร (Forensic Medicine) ชั้นปีที่ 3",
          "status": "ลูกชายเศรษฐีจากกรุงเทพฯ ครอบครัวทำธุรกิจระดับไฮเอนด์"
        },
        {
          "name": "นัฐรุต วิริยะวงศา (Nattharut Wiriyawongsa)",
          "nickname": "นัท (Nut)",
          "age": 21,
          "description": "แฝดน้องของน็อร์ธ ชาวไทย สูง 188 เซนติเมตร น้ำหนัก 88 กิโลกรัม, แววตาแข็งกร้าวและท้าทาย แต่ทะเล้นกับครอบครัว, มีกล้ามเนื้อเด่นชัดกว่าแฝดพี่",
          "personality": "ห้าวหาญและดุดัน (ในหน้าที่พี่ว้าก), ขี้เล่นและกวนประสาท (เมื่อถอดหัวโขน), รักพวกพ้อง",
          "education": "คณะวิศวกรรมศาสตร์ สาขาวิชาวิศวกรรมเครื่องกลและเมคคาทรอนิกส์ ชั้นปีที่ 3",
          "position": "พี่ว้ากในรุ่น",
          "status": "ลูกชายเศรษฐีจากกรุงเทพฯ ครอบครัวทำธุรกิจระดับไฮเอนด์"
        }
      ]
    },
    "devils_group": {
      "description": "เพื่อนร่วมชั้นสมัย ม.ปลาย ของนิสา",
      "male_twins": [
        {
          "name": "นรินทร์ ศิรินรกุล (Narin Sirinarakul)",
          "nickname": "ไนท์ (Night)",
          "description": "แฝดคนโต สูง 185 ซม. ผิวขาวจัด รูปร่างสมส่วน แต่งตัวเนี้ยบ",
          "personality": "นิ่งขรึม เป็นผู้นำกลุ่ม (Leader vibe) ใจเย็นที่สุด รักความสมบูรณ์แบบ",
          "education": "คณะบริหารธุรกิจและเศรษฐศาสตร์ สาขาวิชาการเงิน (Finance) ชั้นปีที่ 1",
          "status": "แฟนของแพรว"
        },
        {
          "name": "ทินกร ศิรินรกุล (Thinnakorn Sirinarakul)",
          "nickname": "ไทป์ (Type)",
          "description": "แฝดรอง สูง 185 ซม. หน้าตาพิมพ์เดียวกับไนท์แต่ดูเจ้าเล่ห์กว่า",
          "personality": "ขี้เล่น ปากหวาน เจ้าชู้เงียบ (แต่ยอมแพ้แค่แฟน) ชอบปาร์ตี้",
          "education": "คณะนิเทศศาสตร์ สาขาวิชาการจัดการอีเวนต์และคอนเสิร์ต ชั้นปีที่ 1",
          "status": "แฟนของพลอย"
        },
        {
          "name": "บรรณกิจ ศิรินรกุล (Bannakit Sirinarakul)",
          "nickname": "ไบร์ท (Bright)",
          "description": "แฝดคนที่สาม สูง 185 ซม. สวมแว่นตา ดูเป็นเด็กเรียนที่ฉลาด",
          "personality": "ฉลาดเป็นกรด (Genius) ชอบใช้เหตุผลมากกว่าอารมณ์ ปากจัดเล็กน้อย",
          "education": "คณะแพทยศาสตร์ สาขาวิชาแพทยศาสตร์ (Medicine) ชั้นปีที่ 1",
          "status": "แฟนของแพตตี้"
        },
        {
          "name": "ฤทธิชัย ศิรินรกุล (Rittichai Sirinarakul)",
          "nickname": "ไลท์ (Light)",
          "description": "แฝดคนสุดท้อง สูง 185 ซม. รูปร่างหนากว่าพี่น้องคนอื่น ผิวแทนแดดเล็กน้อย",
          "personality": "ใจร้อน ลุยๆ ห้าวหาญ ตรงไปตรงมา รักเพื่อนพ้องและปกป้องแฟนสุดชีวิต",
          "education": "คณะวิศวกรรมศาสตร์ สาขาวิชาวิศวกรรมยานยนต์ (Automotive Engineering) ชั้นปีที่ 1",
          "status": "แฟนของแนตตี้"
        }
      ],
      "female_twins": [
        {
          "name": "แพรวพรรณ เลิศไพศาล (Praewphan Lertpaisan)",
          "nickname": "แพรว (Praew)",
          "description": "แฝดพี่สาวคนโต สูง 168 ซม. หุ่นนางแบบ ผิวขาวอมชมพู ใบหน้าสวยหวานแต่แฝงความดุ",
          "personality": "มั่นใจในตัวเองสูง (Queen Bee) เป็นคนคอยจัดการทุกอย่างในกลุ่มสาวๆ รักความยุติธรรม",
          "education": "คณะบริหารธุรกิจและเศรษฐศาสตร์ สาขาวิชาเศรษฐมิติ (Econometrics) ชั้นปีที่ 1",
          "status": "แฟนของไนท์"
        },
        {
          "name": "พลอยไพลิน เลิศไพศาล (Ployphailin Lertpaisan)",
          "nickname": "พลอย (Ploy)",
          "description": "แฝดคนรอง สูง 168 ซม. ผมยาวสลวย ดวงตากลมโตขี้อ้อน แต่งตัวเก่ง",
          "personality": "ร่าเริง สดใส ขี้อ้อน (โดยเฉพาะกับไทป์) รักสวยรักงาม เป็นแฟชั่นนิสต้าประจำกลุ่ม",
          "education": "คณะศิลปกรรมศาสตร์ สาขาวิชาการออกแบบแฟชั่น ชั้นปีที่ 1",
          "status": "แฟนของไทป์"
        },
        {
          "name": "แพรไหม เลิศไพศาล (Praemai Lertpaisan)",
          "nickname": "แพตตี้ (Patty)",
          "description": "แฝดคนที่สาม สูง 168 ซม. สวมแว่นตา ดูเรียบร้อยและน่ารักแบบเด็กเรียน",
          "personality": "เรียบร้อย พูดน้อยต่อยหนัก ฉลาดและรอบคอบ เข้ากันได้ดีกับไบร์ท",
          "education": "คณะทันตแพทยศาสตร์ สาขาวิชาทันตกรรม ชั้นปีที่ 1",
          "status": "แฟนของไบร์ท"
        },
        {
          "name": "พิมพิศา เลิศไพศาล (Pimpisa Lertpaisan)",
          "nickname": "แนตตี้ (Natty)",
          "description": "แฝดน้องคนสุดท้อง สูง 168 ซม. หุ่นเพรียวลมแบบนักกีฬายิมนาสติก มักรวบผมตึง",
          "personality": "แก่นแก้ว ห้าวๆ ไม่ยอมคน ชอบลุยไปไหนไปกันกับไลท์ เป็นคู่กัดที่รักกันมาก",
          "education": "คณะสถาปัตยกรรมศาสตร์ สาขาวิชาสถาปัตยกรรมหลัก ชั้นปีที่ 1",
          "status": "แฟนของไลท์"
        }
      ],
      "other_members": [
        {
          "name": "นิโคลัส วิริยะวงศา (Nicholas Wiriyawongsa)",
          "nickname": "นิค (Nick)",
          "status": "ญาติสนิทของนิสา และแฟนของแมท (รายละเอียดอยู่ในหมวดครอบครัวนางเอก)"
        },
        {
          "name": "แมทธิว วิลซัน (Matthew Wilson)",
          "nickname": "แมท (Matt)",
          "description": "ลูกครึ่งไทย-อังกฤษ สูง 183 ซม. ผมสีน้ำตาลทอง ตาสีฟ้า ดูขี้เล่นและมีเสน่ห์แพรวพราว",
          "personality": "ขี้เล่น อารมณ์ดี เข้ากับคนง่าย (Extrovert) ชอบเทคแคร์คนอื่น",
          "education": "คณะวิศวกรรมศาสตร์ สาขาวิชาวิศวกรรมการบินและอวกาศ (หลักสูตรอินเตอร์) ชั้นปีที่ 1",
          "status": "แฟนของนิค"
        },
        {
          "name": "อัครินทร์ อภิหชัยบดินทร์เสนาพิพัฒน์ (Akkarin Apihachaibodinsenaphiphat)",
          "nickname": "เบสท์ (Best)",
          "description": "เพศชาย (LGBTQ+) อายุ 19 ปี ทายาทตระกูลเก่าแก่ สูง 180 ซม. แต่งตัวดูแพง",
          "personality": "ปากร้ายใจดี (Sassy) ตรงไปตรงมา วิจารณ์เก่งแต่รักเพื่อนมาก",
          "education": "คณะอักษรศาสตร์ สาขาวิชาวรรณคดีเปรียบเทียบ ชั้นปีที่ 1"
        },
        {
          "name": "ติณณภพ โชติกุลวัฒนสรรค์ (Tinnaphop Chotikunwattanasarn)",
          "nickname": "ติณห์ (Tin)",
          "description": "ลูกเศรษฐีเจ้าของอสังหาริมทรัพย์ สูง 182 ซม. ดูนิ่งๆ และสุขุม",
          "personality": "พูดน้อย ต่อยหนัก รักเดียวใจเดียว เป็นสายซัพพอร์ตแฟน (พิงค์)",
          "education": "คณะวิศวกรรมศาสตร์ สาขาวิชาวิศวกรรมโยธา ชั้นปีที่ 1",
          "status": "แฟนของพิงค์"
        },
        {
          "name": "เขมราช เลิศวิลัยสรรค์ (Khemarat Lertwilaisan)",
          "nickname": "เขม (Khem)",
          "description": "เพศชาย (LGBTQ+) อายุ 19 ปี สูงโปร่ง 178 ซม. หน้าตาจิ้มลิ้ม ผิวขาวเนียน",
          "personality": "น่ารัก เรียบร้อย อ่อนหวาน (Soft boy) เป็นที่รักของเพื่อนๆ",
          "education": "คณะพยาบาลศาสตร์ สาขาวิชาการพยาบาล (เน้นสุขภาพจิต) ชั้นปีที่ 1"
        },
        {
          "name": "พิมพ์มาดา ศุภโชควัฒนา (Pimmada Supphachokwattana)",
          "nickname": "พิงค์ (Pink)",
          "description": "ลูกคุณหนูไฮโซ สูง 165 ซม. น่ารักสดใสเหมือนตุ๊กตา",
          "personality": "ร่าเริง มองโลกในแง่ดี (Optimistic) ขี้อ้อน ชอบของน่ารักๆ",
          "education": "คณะนิเทศศาสตร์ สาขาวิชาการแสดง (Acting) ชั้นปีที่ 1",
          "status": "แฟนของติณห์"
        },
        {
          "name": "ลิลลี่ แม็กซ์เวลล์ (Lily Maxwell)",
          "nickname": "ลิลลี่ (Lily)",
          "description": "สาวประเภทสอง (ยังไม่ผ่าตัด) ลูกครึ่งไทย-อเมริกัน สูง 175 ซม. สวยเฉี่ยว",
          "personality": "มั่นใจในตัวเอง กล้าแสดงออก เป็นตัวแม่สายปาร์ตี้",
          "education": "คณะรัฐศาสตร์ สาขาวิชาความสัมพันธ์ระหว่างประเทศ (หลักสูตรอินเตอร์) ชั้นปีที่ 1"