{
  "document_info": {
    "title": "The 7th Sense: Episodic Arc (50 Episodes)",
    "source_file": "แผนการดำเนินเรื่องรายสิบตอน.pdf",
    "version": "1.0",
    "description": "แผนการดำเนินเรื่องรายสิบตอน แบ่งเป็น 5 ช่วง (Blocks) ตามไทม์ไลน์ 1 ปีการศึกษา"
  },
  "episodic_arc": {
    "block_1": {
      "title": "Block 1: การหลอมละลายและเงาปริศนา (The Forge & The Mystery)",
      "timeline": "เทอม 1 (เดือนที่ 1) - เน้นบรรยากาศ SOTUS, การปรับตัว, และการปะทะกันครั้งแรกของพระนาง",
      "episodes": {
        "ep_01": {
          "title": "เฟรชชี่สายมู กับ เจ้าชายหูกระต่าย",
          "event": "วันรายงานตัว นิสาย้ายเข้าหอพักและสัมผัสได้ถึงพลังงานแปลกประหลาดจาก 'มหาหอคอยอาเทอร์เนียม' ที่พุ่งตรงไปยังหนุ่มหล่อท่าทางเสเพล (เนส) ที่กำลังยืนซื้อลูกชิ้นปิ้งอยู่กับยายจันทร์",
          "key_point": "การเจอกันครั้งแรกแบบไม่ประทับใจ นิสาคิดว่าเนสเป็นเด็กเส้นที่ทำตัวไร้สาระ"
        },
        "ep_02": {
          "title": "ห้องเชียร์ทมิฬ (The Dark Room)",
          "event": "กิจกรรมห้องเชียร์วันแรก ปี 1 นั่งนิ่งในความมืด เฮดว้ากเทียนปรากฏตัวพร้อมบรรยากาศกดดัน นิสาเห็น 'ผีปู่ผีย่า' ยืนซ้อนหลังพี่เทียนเพื่อคุมกฎ",
          "key_point": "นิสาเผลอสะดุ้งเมื่อเห็นผี ทำให้โดนเทียนเพ่งเล็ง เนสพยายามช่วย (หรือกวน) จนโดนทำโทษคู่"
        },
        "ep_03": {
          "title": "คู่บัดดี้มหากาฬ (The Rivals)",
          "event": "ประกาศรายชื่อบัดดี้ เนสได้คู่กับนิสา ทั้งคู่ต้องทำโปรเจกต์ 'วงจรไฟกระพริบ' ด้วยกัน เนสแกล้งทำตัวซุ่มซ่ามทำคอนแทคเลนส์เคลื่อนเพื่อทดสอบนิสา",
          "key_point": "แบ่งปันต้องเข้ามาห้ามทัพก่อนที่แล็บจะระเบิดเพราะการตีกัน"
        },
        "ep_04": {
          "title": "แก๊ง Devils และสมุดล่าลายเซ็น",
          "event": "เปิดตัวกลุ่ม Devils ครบทีม (ลูกคุณหนูไฮโซ) ที่โรงอาหารกลาง ปี 1 ได้รับสมุดล่าเกียร์ที่มีช่อง 'สายรหัสลับ'",
          "key_point": "นิสาเริ่มสงสัยในตัว 'พี่ระเบียบดิม' ที่มักจะโผล่มาช่วยแบ่งปันแบบเนียนๆ"
        },
        "ep_05": {
          "title": "คำใบ้จากเงามืด",
          "event": "นิสาได้คำใบ้สายรหัส 'คนที่เห็นในสิ่งที่คนอื่นไม่เห็น' เนสได้คำใบ้ภาษาต่างดาว (รหัสลับนิธอเรีย) จากเอเดรียน",
          "key_point": "เนสเริ่มติดต่อกับเอเดรียนผ่านช่องทางลับใน Smart Lab"
        },
        "ep_06": {
          "title": "สายสืบราชวงศ์ (The Spy)",
          "event": "สายสืบของอเล็กซานเดอร์แฝงตัวเป็นนักศึกษาทุน พยายามขโมยกระเป๋าของเนสในโรงอาหารเพื่อหาสมุดพกประจำตัว",
          "key_point": "นิสาใช้สัมผัสที่ 7 เห็น 'เจตนาสีดำ' และขัดขาให้สายสืบล้ม ช่วยเนสไว้ได้แบบงงๆ"
        },
        "ep_07": {
          "title": "ภารกิจเที่ยงคืน ณ ศาลเจ้าปู่",
          "event": "ดิม (ในฐานะพี่รหัสลับ) สั่งให้นิสาไปไหว้ศาลปู่ผีย่าหลังตึกเครื่องกลตอนเที่ยงคืนเพื่อทดสอบความกล้า",
          "key_point": "นิสาได้สื่อสารกับปู่ธรรม-ย่าทองจริงๆ ท่านฝากคำเตือนถึง 'เด็กหนุ่มตาสีทอง' (เนส)"
        },
        "ep_08": {
          "title": "เจ้าชายสายเสมอ",
          "event": "เนสเริ่มแสดงความอัจฉริยะด้านวิศวกรรมออกมาโดยไม่รู้ตัวขณะช่วยนิสาแก้โจทย์ฟิสิกส์ แต่ยังแกล้งทำเป็นฟลุค",
          "key_point": "นิสาเริ่มจับผิดว่าเนสไม่ใช่คนโง่และเสเพลอย่างที่แสดงออก"
        },
        "ep_09": {
          "title": "พี่เนตรกับความลับ",
          "event": "พี่เนตร (หมอปี 6) แวะมาหานิสาที่คณะ และแอบส่งสัญญาณลับคุยกับเจมส์ (อดีตเฮดว้าก) เรื่องความปลอดภัยของเนส",
          "key_point": "คนอ่านเริ่มเห็นเครือข่ายความลับของครอบครัววิริยะวงศา"
        },
        "ep_10": {
          "title": "เตรียมยาตราทัพ",
          "event": "เทียนเรียกดิมมามอบตำแหน่ง 'Trail Leader' บรรยากาศตึงเครียดก่อนเข้าป่า หอคอยเริ่มส่งคลื่นรบกวนเนส",
          "key_point": "นิสาเห็นนิมิตเงาดำในป่าอุทยาน"
        }
      }
    },
    "block_2": {
      "title": "Block 2: บททดสอบในพงไพร (The Wilderness Trial)",
      "timeline": "เทอม 1 (เดือนที่ 2) - เน้นเหตุการณ์เดินป่า, การเปิดเผยสายรหัส, และจุดพีคของ SOTUS",
      "episodes": {
        "ep_11": {
          "title": "ความเงียบสังหาร (Tactical Silence)",
          "event": "ตี 2 นักศึกษา 1,170 คนเดินเท้าเข้าป่า ห้ามใช้เสียง ดิมคุมขบวนเข้มงวด ผีปู่ผีย่าเกาะตามกิ่งไม้จ้องมอง",
          "key_point": "เนสต้องอดทนไม่ใช้พลังกายเกินมนุษย์เดินแซงเพื่อน"
        },
        "ep_12": {
          "title": "เฟืองเหล็กและเงาดำ",
          "event": "ถึงจุดชันที่สุด เพื่อนเริ่มหมดแรง นิสาเห็นเงาดำพยายามดึงขาเพื่อน เนสตัดสินใจแบกเฟือง 50 กก. แทนเพื่อนตัวเล็ก",
          "key_point": "วินาทีเท่ๆ ของเนสที่ทำให้นิสาใจเต้น (และสงสัย)"
        },
        "ep_13": {
          "title": "พายุวิกฤต (The Storm)",
          "event": "พายุเข้ากะทันหัน แถวขาด ดิมวิทยุสั่งการด้วยเสียงทรงพลังเพื่อคุมสติปี 1",
          "key_point": "ความเป็นผู้นำของดิมฉายแสง พี่ปี 3-4 ยอมรับ"
        },
        "ep_14": {
          "title": "คู่หูนำทาง",
          "event": "กลุ่มของเนสและนิสาหลงออกนอกเส้นทาง นิสาใช้สัมผัสที่ 7 ฟังเสียงปู่ผีย่า เนสคำนวณทิศทางลมและองศา",
          "key_point": "ทั้งคู่ร่วมมือกันพาเพื่อนกลับเข้าแถวได้สำเร็จ"
        },
        "ep_15": {
          "title": "รุ่งสางที่ยอดดอย",
          "event": "การมาถึงจุดหมาย ความเหนื่อยล้า และความสามัคคี เพื่อนช่วยกันพยุงคนเจ็บ",
          "key_point": "ฉากซึ้งๆ ของมิตรภาพ"
        },
        "ep_16": {
          "title": "กำแพงมนุษย์",
          "event": "พิธีชิงเกียร์ เนสและนิสานำทีมฝ่าวงล้อมพี่ปี 2-4 ไปคว้าธง",
          "key_point": "การปลดล็อคความสำเร็จของรุ่น"
        },
        "ep_17": {
          "title": "สายรหัสทองคำ (Part 1)",
          "event": "เจมส์ เทียน และดิม เดินเรียงแถวออกมาเฉลยสายรหัส",
          "key_point": "ดิมสวมเสื้อช็อปให้นิสา เซ็นชื่อ 'รัชชานนท์' จบภารกิจลับ"
        },
        "ep_18": {
          "title": "สายรหัสทองคำ (Part 2)",
          "event": "เจมส์เฉลยว่าเป็นพี่รหัสเนส และบอกว่า 'กูรู้เรื่องมึงหมดแล้วจากไอ้หมอเนตร'",
          "key_point": "เนสช็อกที่ความลับแตก แต่ก็โล่งใจที่มีคนคุ้มกัน"
        },
        "ep_19": {
          "title": "การสืบทอด (Succession)",
          "event": "เทียนมอบจี้เกียร์รมดำให้ดิม สถาปนาเป็นว่าที่เฮดว้ากคนต่อไป",
          "key_point": "ดิมให้คำสัตย์ปฏิญาณ (Sacrifice)"
        },
        "ep_20": {
          "title": "งานเลี้ยงปิดป่า",
          "event": "กลับมามหาลัย กินเลี้ยงสายรหัส เนสเริ่มเนียนไปกินข้าวบ้านยายจันทร์พร้อมนิสา",
          "key_point": "จบ Phase SOTUS เริ่มเข้าสู่ Phase Rom-Com เต็มตัว"
        }
      }
    },
    "block_3": {
      "title": "Block 3: ความลับที่ผลิบาน (Blossoming Relationships)",
      "timeline": "ปลายเทอม 1 - ปิดเทอม - เริ่มเทอม 2 - เน้นความรัก, ปมราชวงศ์, และหอคอยเริ่มตื่น",
      "episodes": {
        "ep_21": {
          "title": "ชีวิตหลังได้ช็อป",
          "event": "บรรยากาศผ่อนคลาย พี่น้องดูแลกัน ดิมเริ่มถอดมาดขรึมเวลาอยู่กับน้อง",
          "key_point": "ดิมเริ่มแอบส่งขนมจีบแบ่งปัน (ผ่านนิสา)"
        },
        "ep_22": {
          "title": "ส้มตำสื่อรัก",
          "event": "เนสไปกินข้าวที่บ้านยายจันทร์ นิสามาเจอและสงสัยว่าทำไม 'หนุ่มเมืองกรุง' ถึงจกข้าวเหนียวคล่องจัง",
          "key_point": "เนสแถสีข้างถลอก แต่ตายายช่วยแก้ต่างให้"
        },
        "ep_23": {
          "title": "Devils ออกโรง",
          "event": "กลุ่ม Devils จัดปาร์ตี้ฉลองจบเทอม เนสโดนกลุ่มสาวสอง (ลิลลี่/เคธี่/จัสมิน) รุมทาบทามเข้าประกวดเดือน",
          "key_point": "เนสปฏิเสธเสียงแข็งเพราะกลัวเด่นเกินไป"
        },
        "ep_24": {
          "title": "สัญญาณแรก (First Resonance)",
          "event": "เนสเดินผ่านหอคอยแล้วเกิดอาการวิงเวียน หูแว่วเสียงสั่นสะเทือน นิสาที่เดินมาด้วยกันได้ยินเสียง 'วิ้ง' ในหู",
          "key_point": "ทั้งคู่รู้ว่าตัวเองมี 'คลื่นความถี่' ตรงกัน"
        },
        "ep_25": {
          "title": "สายสืบเจาะระบบ",
          "event": "สายสืบอเล็กซานเดอร์พยายามแฮกข้อมูล Smart Lab เพื่อดูผลสแกนม่านตาของเนส",
          "key_point": "เอเดรียนช่วยบล็อกทัน และส่งคำเตือนให้เนสระวังตัว"
        },
        "ep_26": {
          "title": "ปิดเทอมระทึก",
          "event": "นิสากลับบ้านกำนันศักดิ์ เนสขอตามไปเที่ยวด้วย (อ้างว่าไปเยี่ยมญาติห่างๆ)",
          "key_point": "กำนันศักดิ์ต้องเล่นละครตบตานิสาเรื่องเนส"
        },
        "ep_27": {
          "title": "เปิดเทอม 2 และชมรมจิตอาสา",
          "event": "เปิดเทอมใหม่ รับสมัครเข้าชมรมจิตอาสาของอาจารย์อนันต์",
          "key_point": "เนส นิสา และ Devils สมัครยกแก๊ง"
        },
        "ep_28": {
          "title": "ความลับของดิม",
          "event": "ดิมเริ่มเครียดกับการวางแผนรับน้องปีหน้า จนเผลอดุแบ่งปัน",
          "key_point": "ดราม่าเล็กๆ ของคู่รอง นิสาต้องเป็นกาวใจ"
        },
        "ep_29": {
          "title": "เส้นสายธรณี",
          "event": "ลงพื้นที่สำรวจหมู่บ้านรอบมหาลัย นิสาเห็น 'เส้นแสง' ใต้ดินที่เชื่อมจากหอคอยมายังหมู่บ้าน",
          "key_point": "ผีปู่ผีย่าเตือนเรื่อง 'การตื่นของเจ้าที่ใหญ่' (หอคอย)"
        },
        "ep_30": {
          "title": "การรุกรานเงียบ",
          "event": "สายสืบเริ่มแฝงตัวมาในคราบช่างซ่อมบำรุงในงานเทศกาลมหาลัย",
          "key_point": "ความตึงเครียดเริ่มก่อตัวก่อนงานใหญ่"
        }
      }
    },
    "block_4": {
      "title": "Block 4: สงครามประสาทและอาเทอร์เนียม (The Tower's Call)",
      "timeline": "เทอม 2 (กลางเทอม) - เน้น Action, สืบสวน, และไคลแมกซ์ของหอคอย",
      "episodes": {
        "ep_31": {
          "title": "เทศกาล NNUT Fair",
          "event": "งานแฟร์ใหญ่ประจำปี คนนอกเข้าได้ สายสืบเตรียมลงมือ",
          "key_point": "เนสต้องระวังตัวแจเพราะต้องถอดแว่นหลอกในบางกิจกรรม"
        },
        "ep_32": {
          "title": "กับดักเรตินา",
          "event": "สายสืบติดตั้งกล้องสแกนเรตินาความละเอียดสูงไว้ที่บูธเกมยิงปืน หวังหลอกให้เนสมาเล่น",
          "key_point": "นิสาใช้สัมผัสที่ 7 เห็น 'รังสีอำมหิต' จากบูธเกม"
        },
        "ep_33": {
          "title": "บัดดี้สายบู๊",
          "event": "เนสและนิสาซ้อนแผน ล่อสายสืบไปที่ตึกร้าง เอเดรียนแฮกกล้องวงจรปิด",
          "key_point": "ฉาก Action ที่เนสโชว์สกิลการต่อสู้ (นิดหน่อย) และนิสาใช้ผีหลอกสายสืบ"
        },
        "ep_34": {
          "title": "ความจริงบางส่วน",
          "event": "หลังจบเรื่องสายสื่บ เนสยอมรับกับนิสาว่าเขามีคนปองร้าย แต่ยังไม่บอกว่าเป็นเจ้าชาย",
          "key_point": "ความเชื่อใจระหว่างพระนางแน่นแฟ้นขึ้น"
        },
        "ep_35": {
          "title": "ค่ายอาสาเดือด",
          "event": "ชมรมออกค่ายอาสาจริงจัง (นอนโรงเรียน ตากแดดแบกปูน)",
          "key_point": "ความสัมพันธ์แบบติดดิน ความฮาของ Devils ที่ต้องมาลำบาก"
        },
        "ep_36": {
          "title": "ดิมกับแบ่งปัน",
          "event": "รอบกองไฟค่ายอาสา ดิมแอบมาขอโทษแบ่งปันและสารภาพความรู้สึก",
          "key_point": "โมเมนต์หวานของคู่รอง"
        },
        "ep_37": {
          "title": "หอคอยคำราม (Resonance Peak)",
          "event": "กลับจากค่าย หอคอยส่งเสียงคำราม (Infrasound) ที่กระจกตึกสั่น เนสปวดหัวรุนแรง",
          "key_point": "Golden Halo ของเนสเริ่มเปล่งแสงทะลุคอนแทคเลนส์"
        },
        "ep_38": {
          "title": "วิกฤตห้องแล็บ",
          "event": "เนสขังตัวเองใน Smart Lab เพื่อคุมอาการ นิสาพังประตูเข้าไปช่วย",
          "key_point": "นิสาเห็น Golden Halo ของเนสเต็มตา"
        },
        "ep_39": {
          "title": "การเจรจากับแฟรี่",
          "event": "นิสาเข้าสู่สภาวะภวังค์ (Trance) สื่อสารกับ 'แฟรี่' ที่ลอยออกมาจากหอคอย",
          "key_point": "แฟรี่บอกเงื่อนไข 'ต้อง Lock พลังงานด้วยรหัสคู่'"
        },
        "ep_40": {
          "title": "Lock The Tower",
          "event": "เนสและนิสาช่วยกันป้อนรหัส (เนส) และจูนคลื่น (นิสา) จนหอคอยสงบลง",
          "key_point": "ทั้งคู่รอดตายหวุดหวิด แต่ผูกพันกันด้วยความลับระดับโลก"
        }
      }
    },
    "block_5": {
      "title": "Block 5: บทสรุปแห่งปี (The Final Mandate)",
      "timeline": "ปลายเทอม 2 - ปิดภาคการศึกษา - บทสรุปความสัมพันธ์และปูทางสู่ปี 2",
      "episodes": {
        "ep_41": {
          "title": "ผลพวงของการสั่นสะเทือน",
          "event": "ผู้บริหารมหาลัยตื่นตระหนก แต่อาจารย์อนันต์ช่วยปิดข่าวว่าเป็น 'การทดลองผิดพลาด'",
          "key_point": "กำนันศักดิ์โทรหาเนตรด้วยความเป็นห่วง"
        },
        "ep_42": {
          "title": "การสอบไฟนอล",
          "event": "กลับมาสู่โหมดนักศึกษา ต้องอ่านหนังสือสอบหัวฟู Devils ติวกันแหลก",
          "key_point": "ความเครียดเรื่องเรียนที่แทรกเข้ามาให้เรื่องดูสมจริง"
        },
        "ep_43": {
          "title": "งาน Bye Nior & สายรหัส",
          "event": "งานเลี้ยงส่งรุ่นพี่ปี 4 (รุ่นเจมส์) บรรยากาศซึ้งและสนุกสนาน",
          "key_point": "เจมส์ฝากฝังเนสให้นิสาดูแล (แบบทีเล่นทีจริง)"
        },
        "ep_44": {
          "title": "การประกาศของดิม",
          "event": "ในวงเหล้าสายรหัส ดิมเปรยกับพี่ๆ ว่า 'ปีหน้าผมเล็งน้องนิสาไว้เป็นเฮดว้ากหญิงนะ'",
          "key_point": "เทียนและเจมส์พยักหน้าเห็นด้วย สร้างความฮือฮา"
        },
        "ep_45": {
          "title": "ทางเลือกของเจ้าชาย",
          "event": "อเล็กซานเดอร์ส่งข้อความมาขู่เนสเป็นครั้งสุดท้ายให้กลับประเทศ",
          "key_point": "เนสตัดสินใจทิ้งตั๋วเครื่องบินและเลือกอยู่ที่นี่ต่อ"
        },
        "ep_46": {
          "title": "เปิดใจที่บ้านยาย",
          "event": "เนสพานิสาไปกราบยายจันทร์และสารภาพความจริงเรื่องเป็นลูกครึ่งราชวงศ์ (ยังไม่บอกว่าเจ้าชายรัชทายาท)",
          "key_point": "ยายจันทร์เลี้ยงขนมปลอบใจ"
        },
        "ep_47": {
          "title": "ความรักที่ลงตัว",
          "event": "ดิมกับแบ่งปันตกลงคบกันแบบเงียบๆ (Low Profile) เพื่อรักษาภาพลักษณ์เฮดว้าก",
          "key_point": "ความหวานที่ลงตัวของคู่รอง"
        },
        "ep_48": {
          "title": "ผู้พิทักษ์หอคอย",
          "event": "เนสและนิสาตกลงกันว่าปีหน้าจะช่วยกันหาคำตอบเรื่องหอคอยต่อ",
          "key_point": "ตั้งเป้าหมายใหม่สำหรับ Season 2"
        },
        "ep_49": {
          "title": "ดินเนอร์ครอบครัวใหญ่",
          "event": "ครอบครัววิริยะวงศา (กำนัน/แม่/พี่ชาย) มากินข้าวกับ ตายายของเนส",
          "key_point": "บรรยากาศอบอุ่นแบบครอบครัวไทย-อีสาน"
        },
        "ep_50": {
          "title": "พระอาทิตย์ตกที่ศาลปู่ (Epilogue)",
          "event": "เนสและนิสานั่งดูพระอาทิตย์ตกที่ศาลปู่ผีย่า พูดถึงอนาคตปี 2 และเดินจับมือกันกลับหอ",
          "key_point": "จบภาค 1 อย่างบริบูรณ์ (Happy Ending & New Beginning)"
        }
      }
    }
  }
}
