{
  "document_info": {
    "title": "The 7th Sense: Protocols & Rules",
    "source_files": [
      "ข้อมูลพื้นฐาน.pdf",
      "กิจกรรมรับน้อง.pdf",
      "มหาหอคอยอาเทอร์เนียม.pdf",
      "ราชวงศ์นิธอเรีย.pdf"
    ],
    "version": "1.0",
    "description": "รวมกฎการเขียน, กฎเหล็กวิศวะ, กฎหอคอย และกฎราชวงศ์"
  },
  "writing_protocols": {
    "continuity": "รักษาความต่อเนื่องของเนื้อหาและรายละเอียดตัวละคร 100% ห้ามมีข้อมูลขัดแย้งกับตอนก่อนหน้า",
    "no_foreshadowing": "ห้ามเกริ่นถึงอนาคตจากมุมมองผู้บรรยาย (Omniscient POV) ยกเว้นเหตุการณ์ที่นางเอกเห็นผ่านนิมิตสัมผัสที่ 7 เท่านั้น",
    "database_accuracy": "ใช้ข้อมูลจากฐานข้อมูลตัวละครและสถานที่อย่างเคร่งครัด 100% ห้ามเปลี่ยนสเปกหรือประวัติกลางคัน",
    "word_count_control": {
      "total_per_episode": "3,000 คำต่อตอน (ตามจำนวนคำจริง)",
      "structure": "แบ่งเป็น 3 พาร์ท (พาร์ทละ 800-1,200 คำ) เพื่อความกระชับและการตัดจบที่น่าติดตาม"
    }
  },
  "sotus_rules": {
    "title": "กฎเหล็ก 7 ประการของวิศวะนิธอเรียเหนือ (7 Pillars of Engineering SOTUS)",
    "description": "ธรรมนูญที่รุ่นพี่และรุ่นน้องต้องยึดถือสูงสุด หากฝ่าฝืนกิจกรรมจะถูกยุติทันที",
    "rules": {
      "1_seniority_with_respect": "เคารพพี่ด้วยใจ พี่ดูแลน้องดุจสายเลือด ห้ามรุนแรงเด็ดขาด (Respect, Not Fear)",
      "2_unity_above_self": "เพื่อนล้มต้องพยุง ห้ามทิ้งใครไว้ข้างหลัง ผลสำเร็จนับจากคนสุดท้าย (No One Left Behind)",
      "3_silence_of_the_forest": "ธรรมชาติคือผู้คุมกฎ ห้ามทิ้งขยะ ห้ามส่งเสียงเกินเขตที่เจ้าหน้าที่กำหนด ฝ่าฝืนปรับตกทั้งรุ่น",
      "4_academic_priority": "กิจกรรมต้องไม่ทับซ้อนเวลาเรียน เกรดตกกิจกรรมหยุดทันที",
      "5_honour_the_gear": "เกียร์ที่ได้มาคือศักดิ์ศรี ห้ามนำไปโอ้อวดข่มผู้อื่น",
      "6_safety_first": "เจ็บป่วยแจ้งพี่พยาบาลหรือเจ้าหน้าที่ทันที ความฝืนไม่ใช่ความเท่",
      "7_sotus_stays_in_sotus": "เมื่อได้เสื้อช็อปแล้ว ทุกคนคือ 'พี่น้อง' ที่มีศักดิ์ศรีเท่ากันในวิชาชีพ จบกิจกรรมคือจบกัน"
    }
  },
  "activity_preparation_protocols": {
    "organizers": {
      "obm": "องค์การบริหารนักศึกษา (อบม.) เป็นแม่งานหลัก จัดตั้ง 'กองอำนวยการรับน้อง' คัดเลือกประธานกลุ่มสี และจัดงบประมาณ",
      "student_council": "สภานักศึกษา เป็นผู้คุมกฎ (Auditor) มีทีม Patrol เดินตรวจตราความปลอดภัยและสิทธิมนุษยชน หากพบการว้ากเกินขอบเขตมีอำนาจสั่งยุติทันที"
    },
    "grouping_strategy": "การแบ่งกลุ่มสีใช้วิธีจับสลากรวมกลุ่มคณะ (เช่น วิศวะ+แพทย์+อักษร) เพื่อสลายพฤติกรรมการแบ่งแยกคณะตั้งแต่ต้น"
  },
  "tower_access_rules": {
    "title": "กฎการเข้าถึงมหาหอคอยอาเทอร์เนียม (The Laws of Access)",
    "rules": {
      "1_physical_mandate": {
        "name": "กฎแห่งอาณัติกายภาพ",
        "condition": "ประตูชั้นนอกสุดจะเปิดออกก็ต่อเมื่อมีการสแกนเรตินาของผู้ที่มี วงแหวนสีทอง (Golden Halo) ที่ชัดเจนเท่านั้น",
        "implication": "เนสเป็นกุญแจดอกเดียวที่มีชีวิต ประตูจะไม่ตอบสนองต่อระเบิดหรือการงัดแงะ"
      },
      "2_spiritual_resonance": {
        "name": "กฎแห่งจังหวะวิญญาณ",
        "condition": "ระบบป้องกันภายในจะสร้าง 'เขาวงกตแรงโน้มถ่วง' ขับไล่ผู้ที่ไม่สามารถสื่อสารกับคลื่นความถี่ธรรมชาติของหอคอยได้",
        "solution": "นิสา (สัมผัสที่ 7) ต้องเป็นผู้นำทางและจับจังหวะการเดินให้เนส"
      },
      "3_fairy_covenant": {
        "name": "กฎแห่งพันธสัญญาแฟรี่",
        "condition": "แฟรี่ (Administrator) จะปรากฏตัวในรอยต่อระหว่างชั้นเพื่อตั้ง 'บททดสอบ' ที่มักจะกวนประสาทหรือวัดใจ",
        "example": "ทำให้เนสหัวเราะจากใจจริง หรือพิสูจน์ความเชื่อใจระหว่างคู่หู"
      },
      "4_law_of_altruism": {
        "name": "กฎแห่งการปฏิเสธความโลภ",
        "condition": "หอคอยจะสะท้อนเจตนา หากผู้เข้าใกล้มีความต้องการอำนาจหรือความโลภ จะถูกแรงดันผลักออกมาทันที",
        "compatibility": "เนส (ผู้ทิ้งอำนาจ) และนิสา (ผู้มีตรรกะสงบ) จึงเป็นคู่ที่เหมาะสมที่สุด"
      }
    }
  },
  "royal_succession_laws": {
    "title": "กฎมณเฑียรบาลว่าด้วยการสืบราชสันตติวงศ์ (The Law of the Golden Halo)",
    "core_principle": "ราชวงศ์นิธอเรียใช้กฎการสืบทอดที่ไม่ได้ยึดตามความอาวุโส (Age) เพียงอย่างเดียว แต่ยึดตาม 'อาณัติแห่งดวงตา' เป็นสำคัญ",
    "conditions": {
      "symbol_of_power": "ผู้มีสิทธิ์สืบทอดบัลลังก์เจ้าหลวง หรือตำแหน่งเจ้าเมือง ต้องมี 'วงแหวนสีทอง' (Golden Halo) ซ้อนอยู่รอบรูม่านตา",
      "legitimacy": "วงแหวนสีทองคือเครื่องหมายยืนยันพันธุกรรมที่สามารถรองรับพลังงานจากหอคอยได้",
      "conflict": "เนส (น้องคนเล็ก) มีวงแหวนชัดเจนที่สุด ในขณะที่พี่ชายคนโตอาจไม่มี หรือมีไม่ชัดเจน ทำให้เกิดความขัดแย้งเรื่องความเหมาะสม"
    }
  }
}
