{
  "document_info": {
    "title": "The 7th Sense: Story Map & Timeline",
    "source_file": "ข้อมูลพื้นฐาน.pdf",
    "section": "3. Story Map: The 7th Sense (สัมผัสรัก สัมผัสลับ)",
    "version": "1.0",
    "description": "โครงสร้างการดำเนินเรื่อง 6 Phase, พัฒนาการตัวละคร และความสัมพันธ์"
  },
  "phases": {
    "phase_1": {
      "title": "Phase 1: การหลอมละลายและปริศนา (The Forge & The Mystery)",
      [cite_start]"time_period": "สัปดาห์ที่ 1 - 4 (กิจกรรมห้องเชียร์ & ล่าลายเซ็น) [cite: 116-117]",
      "events": {
        "the_beginning": {
          [cite_start]"intro": "แนะนำ นิสา เฟรชชี่สาววิศวะที่มีสัมผัสที่ 7 ท่ามกลางบรรยากาศมหาวิทยาลัยที่ทันสมัย และ เนส เจ้าชายตกยากที่พยายามทำตัวกลมกลืนในคราบหนุ่มเสเพล โดยอาศัยอยู่กับ ตาชาญ-ยายจันทร์ (คนในหมู่บ้านเดียวกับกำนันศักดิ์ พ่อนิสา) นิสาเริ่มเห็นกระแสพลังงานจาก มหาหอคอยอาเทอร์เนียม ไหลมาเชื่อมกับเนส [cite: 120-124]",
          "cheer_room": {
            [cite_start]"atmosphere": "ปี 1 ทั้ง 1,170 คน นั่งตัวตรงในความมืด มีเพียงแสงสปอตไลท์ส่องไปที่ เฮดว้ากเทียน (ปี 3) [cite: 126]",
            [cite_start]"conflict": "เทียนใช้จิตวิทยาถามคำถามจี้ใจดำเรื่องความใส่ใจเพื่อนข้างๆ นิสาใช้สัมผัสที่ 7 แอบเห็น 'พลังงานบางอย่าง' ที่อยู่เบื้องหลังพี่ว้าก ซึ่งคือ 'ผีปู่ผีย่า' (ปู่ธรรมและย่าทอง) เจ้าที่ดั้งเดิมที่คนในละแวกนั้นนับถือ ท่านมาปรากฏตัวเพื่อตรวจดูระเบียบวินัยของลูกหลาน [cite: 127]",
            [cite_start]"dim_role": "ดิม (ปี 2) ทำหน้าที่ 'พี่ระเบียบ' คอยคุมแถว แต่สายตามักจะแอบมอง แบ่งปัน ด้วยความเป็นห่วงและแอบเขินอาย [cite: 130]"
          },
          [cite_start]"rivalry": "เนสและนิสาถูกจัดให้ทำงานบัดดี้ร่วมกัน ทั้งคู่กลายเป็นคู่กัดที่ตีกันด้วยเรื่องไร้สาระตลอดเวลา (เช่น เนสแกล้งซุ่มซ่ามให้เลนส์หลุด นิสาแกล้งบอกว่ามีผีขี่คอเนส) โดยมี แบ่งปัน เป็นคนกลางที่คอยห้ามทัพอย่างเหนื่อยอ่อน [cite: 131]"
        },
        "mystery_hunt": {
          [cite_start]"book": "ปี 1 ได้รับสมุดล่าเกียร์ที่มี 'ช่องนามแฝง' สำหรับสายรหัสลับ [cite: 137]",
          [cite_start]"clues": "นิสาได้คำใบ้ว่าสายรหัสเธอคือ 'คนที่เห็นในสิ่งที่คนอื่นไม่เห็น' (ซึ่งคือ ดิม) ส่วนเนสได้คำใบ้ที่ยากสุดขีดจาก เจ้าชายเอเดรียน (ลูกพี่ลูกน้องที่แฝงตัวช่วย) ที่แฝงตัวเข้ามาช่วยส่งข้อมูลลับ [cite: 137]",
          [cite_start]"spy_network": "เจ้าชายอเล็กซานเดอร์ เริ่มส่งสายสืบในคราบกลุ่มนักศึกษาทุนเข้ามาดักจับสัญญาณและพยายามขโมยสมุดล่าลายเซ็นของเนส เพื่อบังคับให้เนสเผย Golden Halo ออกมา แต่นิสาใช้สัมผัสที่ 7 จับพิรุธและช่วยเนสไว้ได้แบบกวนๆ [cite: 138]",
          [cite_start]"trial": "ดิม (ในฐานะสายรหัสลับ) สั่งให้นิสาไปทำภารกิจพิสูจน์ความกล้า เช่น การไปขอขมาศาลปู่ผีย่าหลังตึกเครื่องกลตอนเที่ยงคืน ทำให้นิสาได้สื่อสารกับเจ้าที่อย่างจริงจังเป็นครั้งแรก [cite: 139]"
        }
      }
    },
    "phase_2": {
      "title": "Phase 2: บททดสอบในพงไพร (The Wilderness Trial)",
      [cite_start]"time_period": "สัปดาห์ที่ 5 (ยาตราทัพสู่พงไพร) [cite: 140]",
      "events": {
        "preparation": {
          [cite_start]"secret_meeting": "เฮดว้ากเทียนเรียก ดิม มาพบตอนเที่ยงคืน เพื่อมอบหน้าที่ 'Trail Leader' ดิมต้องประสานงานกับเจ้าหน้าที่อุทยานอย่างใกล้ชิดเพื่อความปลอดภัยสูงสุด [cite: 145]",
          [cite_start]"bad_omen": "หอคอยอาเทอร์เนียม ส่งคลื่นกระตุ้นพลังในตัวเนส นิสาเห็นนิมิต 'เงาดำ' ในป่า เธอและเนสตีกันเรื่องวิธีรับมือแต่สุดท้ายก็ยอมร่วมมือกัน [cite: 146]"
        },
        "silent_march": {
          [cite_start]"procession": "นักศึกษา 1,170 คน เดินเท้าเข้าป่าตอนตี 2 ด้วยความเงียบกริบ (Tactical Silence) โดยมีผีปู่ผีย่าคอยจ้องมองจากบนต้นไม้ใหญ่ตามเส้นทาง [cite: 151]",
          "gear_task": "ตัวแทนสาขาผลัดกันแบกเฟืองเหล็ก 50 กก. [cite_start]เนสโชว์พลังกายแบกเฟืองเหล็กช่วยเพื่อนในจุดที่ชันที่สุด ท่ามกลางความตกใจของนิสาที่เห็นเงาดำพยายามฉุดแถวไว้ [cite: 151]",
          [cite_start]"crisis": "เกิดเหตุการณ์ไม่คาดฝัน (เช่น พายุเข้า หรือสัตว์ป่าตื่นตระหนก) ดิมใช้สติและเสียงที่ทรงพลังประสานงานวิทยุกับอุทยาน สั่งหยุดแถวและจัดระเบียบใหม่ได้ทันท่วงที [cite: 153-154]",
          [cite_start]"resolution": "นิสาใช้สัมผัสที่ 7 ชี้เป้า เนสใช้เทคโนโลยีนำทางเพื่อนที่หลงแถวกลับมาได้ โดยมี ผีปู่ผีย่า คอยช่วยเปิดทางให้เพราะนิสาเคยไปบอกกล่าวไว้ ทำให้สถานการณ์คลี่คลาย พี่ปี 3 และ 4 จับตามองเหตุการณ์นี้ด้วยความพอใจ [cite: 154]"
        }
      }
    },
    "phase_3": {
      "title": "Phase 3: การสถาปนาและการเปิดเผย (The Consecration & Revelation)",
      [cite_start]"time_period": "รุ่งสางของวันที่ 6 ณ ยอดดอย [cite: 155]",
      "events": {
        "final_charge": {
          [cite_start]"fire": "ปี 1 ถอดป้ายชื่อทิ้งลงพานทองเหลือง ประกาศจบความเป็นเด็กใหม่ [cite: 158]",
          [cite_start]"human_wall": "ดิมและปี 2-4 ยืนกอดคอกันเป็นกำแพง เนสและนิสาสลับโหมดจากคู่กัดเป็นคู่หูอัจฉริยะ นำเพื่อนปี 1 ดันฝ่าวงล้อมไปคว้าธงรุ่นได้สำเร็จ [cite: 160]",
          [cite_start]"success": "เฮดว้ากเทียนประกาศยอมรับรุ่นน้อง เสียงเพลงคณะดังกึกก้องป่า [cite: 161]"
        },
        "unmasking": {
          [cite_start]"arrival": "รุ่นพี่จะเดินออกมาเป็น 'สาย' เพื่อแสดงลำดับอาวุโสหน้ากองไฟที่มอดลง [cite: 163]",
          [cite_start]"key_figures": "เจมส์ (ปี 4) เดินนำออกมาในฐานะ 'ปู่เทค' ตามด้วย เทียน (ปี 3) ในฐานะ 'ลุงเทค' และ ดิม (ปี 2) ในฐานะ 'พี่เทค' ของนิสา [cite: 164]",
          [cite_start]"dim_moment": "ดิมเดินตรงเข้าไปหานิสา พร้อมเสื้อช็อปปักชื่อที่เขาเตรียมไว้เองกับมือ เขาบรรจงเซ็นชื่อจริง 'รัชชานนท์' ทับนามแฝงในสมุด เพื่อจบภารกิจสืบหาพี่รหัสลับของนิสา [cite: 165]",
          [cite_start]"tian_moment": "เทียน ขยับเข้าไปตบบ่า ดิม ด้วยสายตาภาคภูมิใจในตัว 'น้องเทค' ที่สามารถนำทางปี 1 ฝ่าฟันกิจกรรมในป่ามาได้สำเร็จ [cite: 166]",
          [cite_start]"james_moment": "เจมส์ ยืนกอดอกมองภาพความสำเร็จของสายเทคตัวเองอย่างสง่างาม เขาคือผู้สืบทอดที่ส่งต่อจิตวิญญาณจากเทียน (น้องเทค) ไปสู่ดิม (หลานเทค) และถึงนิสา (เหลนเทค) [cite: 167]",
          [cite_start]"nes_surprise": "เจมส์ ไม่ใช่แค่ปู่เทคของนิสา แต่เจมส์คือ 'พี่รหัสสายตรง' (ตามรหัสประจำตัวนักศึกษา) ของ เนส โดย เจมส์ ได้รับข้อมูลวงในและรู้ความลับเรื่อง 'ราชวงศ์โรมานอฟ' จาก พี่เนตร (พี่ชายนิสา/แฟนเจมส์) ที่ได้รับคำสั่งจาก กำนันศักดิ์ อีกทอดหนึ่ง เจมส์จึงกลายเป็นผู้คุ้มครองเนสในคราบ 'พี่รหัสจอมดุ' [cite: 171-172]",
          [cite_start]"internal_bond": "นิสา เพิ่งรู้ว่าพี่ชายตัวเอง (เนตร) มีแฟนเป็นถึง 'ปู่เทค' ของเธอเอง (เจมส์) และเป็นพี่รหัสของ 'เนส' [cite: 174]"
        },
        "succession": {
          [cite_start]"ceremony": "เฮดว้ากเทียนเรียกประชุมพี่ปี 3-4 และ ดิม หน้ากองไฟที่มอดลง เทียนถอด 'จี้เกียร์รมดำ' ประจำตำแหน่ง สวมให้ดิม เป็นสัญลักษณ์ว่า 'ดิมคือเฮดว้ากคนต่อไป' [cite: 183]",
          [cite_start]"oath": "ดิมกล่าวคำปฏิญาณว่าจะดูแลรุ่นน้องรุ่นถัดไปให้ดีที่สุด (Sacrifice) [cite: 184]"
        }
      }
    },
    "phase_4": {
      "title": "Phase 4: ความสัมพันธ์ที่ผลิบาน (Blossoming Relationships)",
      [cite_start]"time_period": "หลังได้รับเกียร์ – ปลายเทอม [cite: 184-185]",
      "events": {
        "life_after_gear": {
          [cite_start]"sibling": "ความสัมพันธ์ SOTUS เปลี่ยนเป็นพี่น้องที่อบอุ่น ดิมคอยเทคแคร์นิสาและกลุ่ม Devils เนสพานิสาไปเยี่ยม ตาชาญ-ยายจันทร์ บ่อยขึ้นทำให้นิสาสงสัยในความสนิทสนมของเนสกับคนในหมู่บ้านเธอ [cite: 191-193]",
          [cite_start]"romance": "เนสเริ่มรุกจีบนิสาหนักขึ้น โดยมีกลุ่ม Devils คอยชง แต่ยังคงสถานะคู่กัด ดิมเริ่มแสดงออกกับแบ่งปันมากขึ้น (หลังจากต้องเก๊กขรึมมานาน) แต่ต้องแอบทำเพราะสถานะเฮดว้าก [cite: 195-196]",
          [cite_start]"7th_sense": "นิสาเริ่มยอมรับพลังสัมผัสที่ 7 ของตัวเอง และใช้มันช่วยเหลือคนอื่นในมหาลัยร่วมกับเนส [cite: 198]"
        },
        "royal_plot": {
          [cite_start]"spy": "เจ้าชายอเล็กซานเดอร์ เริ่มระแคะระคายเรื่องเนส สายสืบเริ่มเจาะระบบ Smart Lab [cite: 203]",
          [cite_start]"tower_resonance": "หอคอยอาเทอร์เนียมเริ่มส่งสัญญาณสั่นสะเทือน (Resonance) ที่มีเพียงเนสและนิสาที่รับรู้ได้ เป็นสัญญาณเตือนถึงภัยในเทอม 2 [cite: 205]"
        }
      }
    },
    "phase_5": {
      "title": "Phase 5: ปริศนาหอคอยและความขัดแย้งที่คุกคาม (The Tower's Call)",
      [cite_start]"time_period": "เทอม 2 (สัปดาห์ที่ 1 - 10) [cite: 206]",
      "events": {
        [cite_start]"volunteer_mission": "เนส นิสา และกลุ่ม Devils ลงพื้นที่อาสาในเขตหมู่บ้านของกำนันศักดิ์ นิสาพบว่า 'ผีปู่ผีย่า' พยายามเตือนเรื่องการเชื่อมต่อพลังงานระหว่างเนสกับหอคอยผ่านเส้นสายธรณี [cite: 207]",
        [cite_start]"spy_war": "สายสืบอเล็กซานเดอร์พยายามดักจับเรตินาเนสกลางงานเทศกาลมหาลัย เนสและนิสาต้องสลับโหมดมาบัดดี้สายบู๊เพื่อซ้อนแผนจับสายลับ โดยมี เอเดรียน คอยลบร่องรอย [cite: 208]",
        [cite_start]"leader_pressure": "ดิม ยุ่งกับการเตรียมแผนรับน้องปีหน้าจนเกิดปมงอนกับ แบ่งปัน ทำให้นิสาต้องเข้ามาช่วยไกล่เกลี่ย [cite: 209]"
      }
    },
    "phase_6": {
      "title": "Phase 6: บทสรุปแห่งปีและการเผชิญหน้า (The Final Mandate)",
      [cite_start]"time_period": "เทอม 2 (สัปดาห์ที่ 11 - ปลายภาค) [cite: 210]",
      "events": {
        [cite_start]"tower_crisis": "หอคอย Resonance ขั้นสูงสุดจนเนสคุมพลังไม่อยู่ นิสาต้องใช้สัมผัสที่ 7 สื่อสารกับ 'แฟรี่' (Administrator ของหอคอย) เพื่อขอร้องให้พวกเธอช่วยเปิดระบบและ Lock พลังงานช่วยเนสตามกฎแห่งพันธสัญญาแฟรี่ [cite: 211]",
        [cite_start]"heir_selection": "ในงานเลี้ยงปิดสายรหัส เจมส์และเทียนเฝ้ามองนิสาที่ร่วมมือกับเนสแก้สถานการณ์อย่างมีสติ ดิม (เฮดว้ากคนปัจจุบัน) เริ่มเปรยกับเทียนและเจมส์ว่าเห็น 'เงาของเฮดว้ากหญิง' ในตัวนิสา เป็นการปูทางสู่การคัดเลือกในปีหน้า [cite: 212]",
        [cite_start]"conclusion": "เนสตัดสินใจไม่หนีและเลือกที่จะพิทักษ์หอคอยร่วมกับนิสา ทั้งคู่กุมมือกันหน้าศาลปู่ผีย่าในหมู่บ้าน พร้อมรับศึกจากนิธอเรียที่จะตามมาในปีถัดไป [cite: 213]"
      }
    }
  },
  "character_arcs": {
    [cite_start]"nisa": "จากเด็กที่มีปมเรื่องสัมผัสที่ 7 -> ยอมรับพลังและกลายเป็น 'ตัวเต็ง' ผู้นำรุ่นที่พี่ปี 2-4 ต่างยอมรับ [cite: 215]",
    [cite_start]"nes": "จากเจ้าชายเสเพล -> สู่บุรุษที่กล้ายอมรับหน้าที่และเป็นกำลังสำคัญให้วิศวะนิธอเรียเหนือ [cite: 217]",
    [cite_start]"dim": "จากพี่ระเบียบ -> สู่เฮดว้ากเต็มตัวที่ต้องรับภาระหนักในการคุมรุ่นถัดไป พร้อมรักษาความรักกับแบ่งปัน [cite: 220]"
  },
  "relationship_network": {
    [cite_start]"golden_lineage": "เจมส์ (ปี 4) -> เทียน (ปี 3) -> ดิม (ปี 2) -> นิสา (ปี 1) [cite: 222]",
    [cite_start]"rivals_lovers": "เนส <-> นิสา [cite: 223]",
    [cite_start]"secret_couple": "ดิม <-> แบ่งปัน [cite: 224]",
    [cite_start]"guardians": "กลุ่ม Devils + พี่ชายทั้ง 3 ของเนส (คอยช่วยอยู่ห่างๆ) [cite: 225]"
  }
}