{
  "document_info": {
    "title": "The 7th Sense: World Building Database",
    "source_files": [
      "ข้อมูลมหาวิทยาลัย.pdf",
      "คณะ.pdf",
      "ประชากร.pdf",
      "ชมรมจิตอาสา มหาวิทยาลัยเทคโนโลยีนิธอเรียเหนือ.pdf",
      "มหาหอคอยอาเทอร์เนียม.pdf",
      "ราชวงศ์นิธอเรีย.pdf"
    ],
    "version": "1.0",
    "description": "ฐานข้อมูลการสร้างโลก (World Building) ฉบับสมบูรณ์แบบไม่ตัดทอนรายละเอียด"
  },
  "university_info": {
    "name": {
      "thai": "มหาวิทยาลัยเทคโนโลยีนิธอเรียเหนือ",
      "english": "North Nithoria University of Technology",
      "abbreviation": "NNUT"
    },
    "history_and_foundation": {
      "origin": "ก่อตั้งขึ้นตามพระราชประสงค์และภายใต้พระบรมราชูปถัมภ์ของราชวงศ์แห่ง ราชอาณาจักรนิธอเรีย (Kingdom of Nithoria) ซึ่งเป็นประเทศสมมติที่เป็นเกาะขนาดใหญ่ตั้งอยู่ ณ ซีกโลกใต้ นิธอเรียเป็นชาติมหาอำนาจทางเทคโนโลยีที่มีความก้าวหน้าทางวิศวกรรมและนวัตกรรมขั้นสูงในระดับแนวหน้าของโลก",
      "location_strategy": "การขยายวิทยาเขตมายังประเทศไทยนับเป็นยุทธศาสตร์การทูตทางปัญญาที่สำคัญที่สุดของราชวงศ์ โดยทางราชวงศ์ได้ทำการสำรวจและคัดเลือกพื้นที่ตั้งใน ภาคตะวันออกเฉียงเหนือ (อีสาน) ของประเทศไทยอย่างพิถีพิถัน เนื่องจากมีลักษณะภูมิศาสตร์ ภูมิอากาศ และบริบททางวัฒนธรรมท้องถิ่นที่คล้ายคลึงกับ ภูมิภาคทางเหนือของประเทศนิธอเรีย เป็นอย่างมาก",
      "concept": "อาณานิคมทางปัญญาที่สมบูรณ์แบบที่สุดบนพื้นที่ 10,000 ไร่ โดยมุ่งเน้นการเป็นมหาวิทยาลัยต่างชาติที่นำโมเดล Smart City มาใช้อย่างเต็มรูปแบบ"
    },
    "seal": {
      "concept": "สะท้อนถึงอำนาจ ความรู้ และความเชื่อมโยงระหว่างโลกวัตถุกับจิตวิญญาณ",
      "components": {
        "crown": "มงกุฎราชวงศ์นิธอเรีย (The Royal Crown of Nithoria): ประดิษฐานอยู่ ณ ตำแหน่งสูงสุดของตราสัญลักษณ์ เป็นมงกุฎทองคำที่ประดับด้วยอัญมณีล้ำค่า 7 ชนิด เปล่งรัศมีเจิดจรัส สื่อความหมายถึง 'สัมผัสทั้งเจ็ด' (The 7th Senses)",
        "shield": {
          "name": "โล่อาร์มพิทักษ์ปัญญา (The Shield of Wisdom)",
          "quartering": {
            "part_1": "เฟืองจักรกลและวงจรไฟฟ้า: สื่อถึงความเป็นเลิศทางวิศวกรรมและเทคโนโลยีสมัยใหม่",
            "part_2": "รวงข้าวและดอกไม้ท้องถิ่น: สื่อถึงความอุดมสมบูรณ์ของเกษตรกรรมในภาคอีสานและนิธอเรียเหนือ",
            "part_3": "คัมภีร์โบราณพร้อมปากกาขนนก: สื่อถึงการจดบันทึกประวัติศาสตร์ มนุษยศาสตร์ และภูมิปัญญาบรรพกาล"
          }
        },
        "banner": "นามสถาบัน: ฐานล่างของโล่โอบล้อมด้วยแถบแพรสีน้ำเงินรอยัล สลักชื่อมหาวิทยาลัยภาษาอังกฤษว่า North Nithoria University of Technology และอักษรย่อ NNUT อย่างชัดเจน"
      }
    },
    "colors": {
      "royal_nithorian_blue": "สีน้ำเงินเข้มลึกที่สกัดมาจากครามธรรมชาติของเกาะนิธอเรีย สื่อถึงมหาสมุทรอันกว้างใหญ่ที่โอบล้อมมาตุภูมิ ความสุขุมนุ่มลึกทางปัญญา ความลึกลับของศาสตร์ที่ยังค้นไม่พบ และความจงรักภักดีต่อสถาบันพระมหากษัตริย์",
      "amber_gold": "สีเหลืองทองสุกสว่าง ดั่งแสงอาทิตย์ยามเช้าที่สาดส่องลงบนทุ่งข้าวในภาคอีสานและทุ่งหญ้าในนิธอเรียเหนือ สื่อถึงความรุ่งโรจน์ ความมั่งคั่งของทรัพยากร และความอบอุ่นของวัฒนธรรมท้องถิ่น"
    },
    "identity": "'นวัตกรผู้บุกเบิกและพิทักษ์รากเหง้า' (The Pioneer Guardian) อัตลักษณ์ของประชากร NNUT คือการเป็นผู้ที่มีตรรกะทางวิทยาศาสตร์ที่เฉียบคม มีทักษะในการใช้เทคโนโลยีขั้นสูงเพื่อพิสูจน์ความจริง แต่ในขณะเดียวกันก็มีความอ่อนน้อม เคารพ และพยายามทำความเข้าใจในรากเหง้าของความเชื่อ ธรรมชาติ และสิ่งลี้ลับที่มองไม่เห็นด้วยตาเปล่า",
    "vision": "'มุ่งสู่การเป็นมหาวิทยาลัยอัจฉริยะต้นแบบแห่งทักษิณาทิศ ที่มีระบบนิเวศพึ่งพาตนเองได้ 100% เพื่อสร้างสรรค์นวัตกรรมที่ยั่งยืนและไขความลับแห่งธรรมชาติ'"
  },
  "infrastructure": {
    "concept": "ระบบเมืองอัจฉริยะที่พึ่งพาตนเองได้สมบูรณ์แบบ (Self-Sustaining Smart City Infrastructure) ออกแบบให้เป็นเอกเทศจากโลกภายนอก 100%",
    "energy_system": {
      "solar_rooftop": "ติดตั้งแผงโซล่าเซลล์ (Photovoltaic) บนชั้นดาดฟ้า 100% เต็มพื้นที่พื้นผิวที่รับแสงได้ ของอาคารทุกหลังในพื้นที่ 10,000 ไร่",
      "smart_grid_storage": "พลังงานส่วนเกินจะถูกส่งไปจัดเก็บไว้ที่ สถานีไฟฟ้าย่อย ซึ่งติดตั้งระบบกักเก็บพลังงานด้วยแบตเตอรี่ลิเธียมไอออนขนาดมหึมา (ESS) เพื่อจ่ายไฟหลักในช่วงกลางคืนหรือพายุ",
      "biomass_plant": "โรงไฟฟ้าชีวมวล (Biomass Power Plant) ใช้เศษวัสดุการเกษตรและมูลสัตว์ผลิตไฟฟ้าเสริม"
    },
    "water_system": {
      "reservoir": "อ่างเก็บน้ำแก้มลิงขนาดยักษ์ (The Reservoir) พื้นที่ลุ่มต่ำธรรมชาติถูกปรับปรุงให้เป็นอ่างเก็บน้ำขนาดมหึมาเพื่อกักเก็บน้ำฝนและน้ำท่าตามธรรมชาติ",
      "water_reclamation": "โรงบำบัดน้ำเสียเทคโนโลยีสูง (Water Reclamation Plant) ใช้ระบบ MBR รีไซเคิลน้ำเสียกลับมาเป็นน้ำสะอาดจนสามารถใช้ในระบบหล่อเย็นและรดน้ำต้นไม้ได้ 100%",
      "water_towers": "หอคอยแท็งก์น้ำแรงดันสูง ใช้แรงโน้มถ่วงในการส่งจ่ายน้ำประปา"
    },
    "zones": {
      "academic_research": {
        "description": "ศูนย์กลางปัญญาและเทคโนโลยีระดับพรมแดน (Academic & Research Center)",
        "facilities": [
          "อาคารสำนักวิชา (Flexible Space)",
          "Smart Lab (พื้นที่ควบคุมพิเศษ 100% เข้า-ออกด้วย Smart Card บันทึก Log ละเอียด)",
          "ศูนย์เครื่องมือและศูนย์วิจัย (รวมเครื่องมือวิทยาศาสตร์ราคาสูง)",
          "หอชมดาว (University Observatory) บนเนินสูงที่สุด"
        ]
      },
      "residential": {
        "description": "เมืองขนาดย่อมบนเนื้อที่กว่า 2,000 ไร่ รองรับประชากรเกือบ 40,000 คน",
        "ground_floor_standard": "ชั้นที่ 1 ของทุกอาคารเป็นพื้นที่ส่วนกลาง 100% มีโต๊ะ รปภ., ห้องควบคุมระบบ, ห้องซัก-อบผ้า, ตู้จำหน่ายสินค้า, Co-working Space, และห้องพักอาจารย์ที่ปรึกษาหอพัก (RA)",
        "undergraduate_dorms": {
          "buildings": "ประมาณ 30 อาคาร",
          "capacity": "4 คนต่อห้อง",
          "furniture": "Bed-over-Desk (เตียงนอนอยู่บน โต๊ะเขียนหนังสืออยู่ล่าง) 4 หลัง",
          "facilities": "ห้องน้ำในตัว, ตู้เสื้อผ้าส่วนตัว, ระเบียง"
        },
        "graduate_dorms": {
          "buildings": "ประมาณ 20 อาคาร",
          "capacity": "2 คนต่อห้อง",
          "furniture": "Bed-over-Desk 2 หลัง",
          "facilities": "ห้องน้ำในตัว, ระเบียง"
        },
        "facilities": [
          "ศูนย์บริการหอพักนักศึกษา",
          "โรงอาหารกลางโซนหอพัก",
          "อาคารกิจการนักศึกษาและอาคารจัดกิจกรรมย่อย (1, 2, 3)",
          "ย่านการค้าอัจฉริยะ (ร้านสะดวกซื้อ, ร้านกาแฟ)"
        ]
      },
      "landmarks": {
        "main_hall": "หอประชุมใหญ่ประจำมหาวิทยาลัย มี 'พื้นที่ลับใต้เวที' (The Void) ที่มืดสนิทและพลังงานหนาแน่น",
        "shrine": "ศาลเจ้าปู่ / ศาลพระภูมิประจำมหาวิทยาลัย ตั้งอยู่บริเวณทางเข้าหลัก"
      },
      "operations_nature": {
        "farm": "ฟาร์มมหาวิทยาลัย มีโรงเรือนอัจฉริยะ แปลงทดลองพืช และพื้นที่ปศุสัตว์",
        "forest": "พื้นที่ป่าอนุรักษ์และอ่างเก็บน้ำ พื้นที่รกร้าง ป่าดิบชื้นหนาแน่น จุดบรรจบของวิทยาศาสตร์และสิ่งลึกลับ"
      }
    },
    "transportation": {
      "nithoria_bus": "รถม่วงนิธอเรีย วิ่งเป็นวงกลมต่อเนื่อง (The Loop) ออกทุก 15-30 นาที หมดเวลา 21.00 น.",
      "private_vehicles": "อนุญาตให้ใช้รถส่วนตัวได้ 100%"
    }
  },
  "faculties": {
    "health_medical": {
      "name": "กลุ่มวิทยาศาสตร์สุขภาพและนวัตกรรมทางการแพทย์",
      "faculties": [
        { "name": "คณะแพทยศาสตร์", "majors": ["แพทยศาสตร์", "เวชศาสตร์ชันสูตร (Forensic Medicine)"] },
        { "name": "คณะพยาบาลศาสตร์", "majors": ["การพยาบาล (บริบาล, เวชปฏิบัติฉุกเฉิน, สุขภาพจิต)"] },
        { "name": "คณะเภสัชศาสตร์", "majors": ["เภสัชกรรม (ปรุงยา, อุตสาหการ, พิษวิทยา)"] },
        { "name": "คณะสหเวชศาสตร์", "majors": ["รังสีเทคนิค", "เทคนิคการแพทย์", "กายภาพบำบัด"] },
        { "name": "คณะทันตแพทยศาสตร์", "majors": ["ทันตกรรม"] },
        { "name": "คณะสัตวแพทยศาสตร์", "majors": ["สัตวแพทยศาสตร์"] },
        { "name": "คณะสาธารณสุขศาสตร์", "majors": ["สาธารณสุขศาสตร์"] },
        { "name": "คณะวิทยาศาสตร์การกีฬา", "majors": ["วิทยาศาสตร์การกีฬา"] }
      ]
    },
    "engineering": {
      "name": "คณะวิศวกรรมศาสตร์",
      "majors": [
        "วิศวกรรมอิเล็กทรอนิกส์ (Electronics & Machine Learning)",
        "วิศวกรรมไฟฟ้า",
        "วิศวกรรมคอมพิวเตอร์และปัญญาประดิษฐ์",
        "วิศวกรรมโทรคมนาคม",
        "วิศวกรรมเครื่องกลและเมคคาทรอนิกส์",
        "วิศวกรรมยานยนต์",
        "วิศวกรรมการผลิต",
        "วิศวกรรมเคมีและวัสดุ",
        "วิศวกรรมโยธา",
        "วิศวกรรมสิ่งแวดล้อม",
        "วิศวกรรมชีวการแพทย์ (Biomedical Engineering)",
        "วิศวกรรมการบินและอวกาศ",
        "วิศวกรรมโลจิสติกส์"
      ]
    },
    "science": {
      "name": "กลุ่มวิทยาศาสตร์ธรรมชาติและศาสตร์แห่งจักรวาล",
      "faculties": [
        { "name": "คณะวิทยาศาสตร์", "majors": ["ฟิสิกส์ขั้นสูง", "เคมี", "ชีววิทยา", "คณิตศาสตร์และสถิติ"] },
        { "name": "คณะเกษตรศาสตร์และเทคโนโลยีอาหาร", "majors": ["สัตวบาล", "พืชศาสตร์", "วิศวกรรมอาหาร"] },
        { "name": "คณะเทคโนโลยีสารสนเทศ", "majors": ["วิทยาการข้อมูล (Data Science)", "คลาวด์คอมพิวติ้ง"] },
        { "name": "คณะทรัพยากรธรรมชาติ", "majors": ["ธรณีวิทยา", "อุตุนิยมวิทยา", "สมุทรศาสตร์"] }
      ]
    },
    "entertainment_arts": {
      "name": "กลุ่มอุตสาหกรรมบันเทิงและศิลปกรรมสร้างสรรค์",
      "faculties": [
        { "name": "คณะนิเทศศาสตร์", "majors": ["ภาพยนตร์", "การแสดง (Acting)", "การเขียนบท", "การจัดการอีเวนต์และคอนเสิร์ต"] },
        { "name": "คณะดุริยางคศิลป์", "majors": ["การขับร้อง", "ดนตรีสากล", "ดนตรีพื้นเมือง", "เทคโนโลยีดนตรี (Sound Design)"] },
        { "name": "คณะดิจิทัลอาร์ต", "majors": ["แอนิเมชันและ VFX", "การออกแบบเกมและ E-Sports"] },
        { "name": "คณะศิลปกรรมศาสตร์", "majors": ["การออกแบบแฟชั่น", "ทัศนศิลป์", "การออกแบบผลิตภัณฑ์"] },
        { "name": "คณะสถาปัตยกรรมศาสตร์", "majors": ["สถาปัตยกรรมหลัก", "การผังเมือง", "การออกแบบนิทรรศการ"] }
      ]
    },
    "humanities_social": {
      "name": "กลุ่มมนุษยศาสตร์ สังคมศาสตร์ และการจัดการ",
      "faculties": [
        { "name": "คณะอักษรศาสตร์", "majors": ["คติชนวิทยา (Folklore)", "ภาษาศาสตร์เชิงประวัติศาสตร์", "วรรณคดีเปรียบเทียบ"] },
        { "name": "คณะประวัติศาสตร์และโบราณคดี", "majors": ["การตีความโบราณวัตถุ", "การจัดการมรดกวัฒนธรรม"] },
        { "name": "คณะปรัชญาและศาสนวิทยา", "majors": ["ศาสนาเปรียบเทียบ", "ตรรกศาสตร์", "เทววิทยา"] },
        { "name": "คณะนิติศาสตร์", "majors": ["กฎหมายมหาชน", "กฎหมายอาญา", "นิติปรัชญา"] },
        { "name": "คณะรัฐศาสตร์", "majors": ["การเมืองการปกครอง", "ความสัมพันธ์ระหว่างประเทศ", "อาชญาวิทยา"] },
        { "name": "คณะครุศาสตร์", "majors": ["หลักสูตรและการสอน", "เทคโนโลยีการศึกษา", "พลศึกษา"] },
        { "name": "คณะบริหารธุรกิจและเศรษฐศาสตร์", "majors": ["การตลาดดิจิทัล", "การเงิน", "การบัญชี", "เศรษฐมิติ"] }
      ]
    }
  },
  "population": {
    "students": {
      "undergraduate": {
        "total": 26640,
        "calculation": "74 สาขา x 360 คน (90 คน/ชั้นปี x 4 ปี)"
      },
      "graduate": {
        "total": 4440,
        "calculation": "74 สาขา x 60 คน (รวมโทและเอก)"
      },
      "total_students": 31080
    },
    "staff": {
      "academic": {
        "total": 2100,
        "breakdown": "วิศวะ/วิทย์ 1,200 คน, ศิลป์/สังคม 900 คน"
      },
      "residential_advisors": 50
    },
    "support_operations": {
      "engineering_tech": 400,
      "security_traffic": 400,
      "agriculture": 150,
      "housekeeping": 320,
      "services_admin": 600
    },
    "grand_total": 36000
  },
  "volunteer_club": {
    "name": "ชมรมจิตอาสา มหาวิทยาลัยเทคโนโลยีนิธอเรียเหนือ (NNUT Volunteer Club)",
    "structure": {
      "advisors": [
        "รศ.ดร. อนันต์ (อาจารย์ที่ปรึกษาหลัก)",
        "หน่วยอาจารย์แพทย์และอาจารย์พยาบาล (Medical Supervisors)",
        "หัวหน้าแม่บ้าน (Support Coordinator)"
      ],
      "student_exec": [
        "ประธานชมรม – เทียน (ปี 3 วิศวะ)",
        "คณะกรรมการสายงานช่าง (The Technical Gears)",
        "คณะกรรมการสายงานประสานและสันทนาการ (The Joy & Outreach)",
        "คณะกรรมการสายงานพยาบาลและสาธารณสุข (The Medics)"
      ]
    },
    "membership": {
      "policy": "รับนักศึกษาจากทุกสาขาวิชา โดยไม่มีการจำกัดคณะหรือชั้นปี ไม่มีการใช้อำนาจว้ากใส่คนนอกคณะ",
      "screening": "กระบวนการคัดกรองธรรมชาติ (Natural Attrition) งานเน้นความลำบากจริง"
    },
    "activities": {
      "on_campus": ["Weekly Meeting", "Engineering Workshop", "Medical Drill"],
      "grand_field_trip": "โครงการค่ายอาสานิธอเรียสัญจร มุ่งหน้าสู่พื้นที่ห่างไกลของประเทศไทย",
      "daily_tasks": [
        "ศูนย์บริการข้อมูลและประสานงานดิจิทัล",
        "หน่วยปฏิบัติการเทคนิคและนวัตกรรม",
        "หน่วยสวัสดิการและส่งเสริมสุขภาวะ"
      ]
    },
    "culture": {
      "relax_mode": "โหมดปล่อยจอย (หลัง 18:00 น.) ถอดมาดโหดทิ้ง กลายเป็นพี่ชายที่ขี้เล่น",
      "working_mode": "จริงจังกับงาน (Working Hours) ทุกคนต้องมีวินัยสูงสุด ความผิดพลาดด้านเทคนิคถือเป็นเรื่องใหญ่",
      "secrecy": "ความลับแห่งค่าย ห้ามนำเรื่องหลุดๆ ของรุ่นพี่กลับไปเม้าท์ในมหาลัย"
    },
    "facilities": {
      "hq": "อาคารกิจกรรมนักศึกษา 1 (มีโซนแล็บช่างและโซนพักผ่อน)",
      "vehicles": "รถม่วงนิธอเรีย",
      "equipment": "โดรนสำรวจ, เครื่องตรวจจับพลังงาน, ชุดเครื่องมือช่าง"
    }
  },
  "royal_family_history": {
    "origin": "บรรพบุรุษชาวผิวขาวจากยุโรปเหนืออพยพลงมาทางใต้ของโลกและค้นพบเกาะที่มี มหาหอคอยอาเทอร์เนียม ตั้งอยู่ก่อนแล้ว",
    "sovereigns": {
      "king": "สมเด็จพระราชาธิบดีเวโรนัน โรมานอฟ (HM King Veronon Romanov) - ผู้กุมความลับสูงสุดของหอคอย",
      "queen": "สมเด็จพระราชินีเบียทริซ โรมานอฟ (HM Queen Beatrice Romanov) - ผู้ดูแลกฎมณเฑียรบาล"
    },
    "inheritance_law": "The Law of the Golden Halo - ผู้มีสิทธิ์สืบทอดต้องมี วงแหวนสีทอง (Golden Halo) ที่ซ้อนอยู่รอบรูม่านตา เท่านั้น"
  },
  "aternium_tower": {
    "name": "มหาหอคอยอาเทอร์เนียม",
    "appearance": {
      "structure": "ปริซึมแปดเหลี่ยม ความสูง 100 ชั้น สีขาวมุก ไร้รอยต่อ",
      "shadowless": "การไร้เงา แสงอาทิตย์จะถูกนำทางอ้อมผ่านตึกไปปรากฏอีกด้านหนึ่ง"
    },
    "material": "อาเทอร์เนียม (Aternium) - แข็งแกร่ง ไร้รอยขีดข่วน ค่าความเสื่อมสภาพเป็นศูนย์ เป็นฉนวนสัมบูรณ์",
    "interior": "ที่พักอาศัยระดับสูงสุด 100% มีระบบช่วยพยุงชีพ สวนลอยฟ้า แสงสว่างจากผนัง ลิฟต์แรงโน้มถ่วง",
    "mystery": "ไม่เคยมีมนุษย์คนใดเข้าสู่ภายในได้เลย ประตูยังคงปิดสนิทมานับพันปี",
    "rules": {
      "physical_mandate": "ประตูชั้นนอกสุดจะเปิดออกก็ต่อเมื่อมีการสแกนเรตินาของผู้ที่มี Golden Halo",
      "spiritual_resonance": "ระบบป้องกันภายในจะไม่ขับไล่เฉพาะผู้ที่ 'สื่อสาร' กับหอคอยได้ (ใช้สัมผัสที่ 7)",
      "fairy_covenant": "แฟรี่ (Administrator) จะปรากฏตัวเพื่อตั้งคำถามหรือบททดสอบ",
      "law_of_altruism": "หอคอยจะสะท้อนเจตนา หากมีความโลภจะถูกดีดออกมา"
    }
  }
}
